
Функция СведенияОВнешнейОбработке() Экспорт     
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.3.0");
	ПараметрыРегистрации.Информация 		= НСтр("ru = 'Отчет используется для анализа доступности персонала, с учетом уже созданных документов.'");
	ПараметрыРегистрации.Наименование 		= НСтр("ru = 'Работа сотрудников'");	
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия 			= "1.0";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	
	Команда 								= ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление 					= НСтр("ru = 'Работа сотрудников'");
	Команда.Идентификатор 					= "РаботаСотрудников";
	Команда.Использование 					= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение 			= Ложь;
	Команда.Модификатор 					= "ПечатьMXL";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции