
Функция СведенияОВнешнейОбработке() Экспорт   

	ВерсияВО = "1.0";
	КраткоВО = "Пакетная выписка ПЛ";
	ИнформацияВО = "Пакетная выписка путевых листов (УАТ)";
	ИдентификаторВО = "ПакетнаяВыпискаПЛ";
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Информация = НСтр("ru = '" + ИнформацияВО + "'");
	ПараметрыРегистрации.Версия = ВерсияВО;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = КраткоВО;
	НоваяКоманда.Идентификатор = ИдентификаторВО;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;

КонецФункции