Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура();
	РегистрационныеДанные.Вставить("Наименование", "Отчет по путевым листам");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "v 1.1");
	РегистрационныеДанные.Вставить("Информация", "Отчет по путевым листам");
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Идентификатор");
	тз.Колонки.Добавить("Использование");
	тз.Колонки.Добавить("Представление");
	
	НоваяСтрока = тз.Добавить();
	НоваяСтрока.Идентификатор = "ОткрытьОтчет";
	НоваяСтрока.Использование = "ОткрытиеФормы";
	НоваяСтрока.Представление = "Отчет по путевым листам";
	
	РегистрационныеДанные.Вставить("Команды", тз);
	
	Возврат РегистрационныеДанные;
	
КонецФункции
                                       