Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
    ПараметрыРегистрации.Информация = НСтр("ru = 'Внешний отчет по всем путевым листам за период  (версия 1.1)'");
    ПараметрыРегистрации.Версия = "1.1"; 
	ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
	
    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = "Отчет по всем путевым листам за период (версия 1.1)";
    НоваяКоманда.Идентификатор = "ВнОтчетПоПутевымЛистамВПривязкеКРеестру_1_1";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    НоваяКоманда.ПоказыватьОповещение = Ложь;

    Возврат ПараметрыРегистрации;
КонецФункции 