//Номенклатура
&НаКлиенте
Процедура Выгрузить(Команда)
    ВыгрузитьНаСервере();	
КонецПроцедуры
	
&НаСервере
Процедура ВыгрузитьНаСервере() ///В обработчике событий Перед обработкой справочника номенклатуры
	ОбъектНоменклатура =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("1e57d82f-bacd-11f0-8ed4-00155d0c8404")); //Включено 
	//ОбъектНоменклатура =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("9db2bede-c224-11e3-a7f0-005056b6288a")); //Не включено
	//Все, что ниже вставить в обработчик и раскомментировать
	//КОПИРОВАТЬ ВОТ ЭТО{
	//ОбъектНоменклатура =  Объект; //В продакшене
	Настройка = ПланыВидовХарактеристик.игсНастройкиМеханизмов.НоменклатураПодлежащаяВыгрузкеВУАТ;
	СсылкаНаПапкуНоменклатуры = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	игсНастройкиМеханизмовСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.игсНастройкиМеханизмов.СрезПоследних(, Настройка = &Настройка) КАК игсНастройкиМеханизмовСрезПоследних";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
	    СсылкаНаПапкуНоменклатуры = РезультатЗапроса.Значение;	
	КонецЦикла;	
	
	Если ОбъектНоменклатура.Родитель <> СсылкаНаПапкуНоменклатуры Тогда
	    Отказ = Истина;	
	КонецЕсли;	
	//}	
КонецПроцедуры	

//Подразделения

&НаКлиенте
Процедура ВыгрузитьПодразделения(Команда)
	ВыгрузитьПодразделенияНаСервере();
КонецПроцедуры

Процедура ВыгрузитьПодразделенияНаСервере() //В обработчике событий Перед обработкой справочника подразделения организации  
	//ОбъектПодразделение = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор("d46edd0d-9471-11f0-8ed4-00155d0c8404")); //Не верная
	ОбъектПодразделение = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор("c678d80c-6c46-11f0-8ed3-00155d0c8404")); //Верная
	//Все, что ниже вставить в обработчик и раскомментировать
	//КОПИРОВАТЬ ВОТ ЭТО{
	//ОбъектПодразделение =  Объект; //В продакшене
	Настройка = ПланыВидовХарактеристик.игсНастройкиМеханизмов.ОрганизацияПодразделенияКоторойПодлежатВыгрузкеВУАТ;
	СсылкаНаОрганизацию = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	игсНастройкиМеханизмовСрезПоследних.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.игсНастройкиМеханизмов.СрезПоследних(, Настройка = &Настройка) КАК игсНастройкиМеханизмовСрезПоследних";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		СсылкаНаОрганизацию = РезультатЗапроса.Значение;	
	КонецЦикла;	

	Если ОбъектПодразделение.Владелец <> СсылкаНаОрганизацию Тогда
	    Отказ = Истина;	
	КонецЕсли;
	//}		
КонецПроцедуры	
	