
&НаСервере
Процедура ПечатьПутевойНаСервере() 
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ВесьПутевойЛист");
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.МассивЗначений(СсылкаНаДокумент);
	ОбъектыПечати = Новый СписокЗначений;
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ТабДок.Очистить();
	
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
	
		ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПутевой(Команда)
	ПечатьПутевойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьПутевойМаршрутныйНаСервере()

	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ВесьПутевойЛистИМаршрутныйЛист");
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.МассивЗначений(СсылкаНаДокумент);
	ОбъектыПечати = Новый СписокЗначений;
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ТабДок.Очистить();
	
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
	
		ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
		
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПечатьПутевойМаршрутный(Команда)
	ПечатьПутевойМаршрутныйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьЛицевойНаСервере()

	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ЛицеваяСторонаПутевогоЛиста");
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.МассивЗначений(СсылкаНаДокумент);
	ОбъектыПечати = Новый СписокЗначений;
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ТабДок.Очистить();
	
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
	
		ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
		
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЛицевой(Команда)
	ПечатьЛицевойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьОборотнойНаСервере()
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ОборотнаяСторонаПутевогоЛиста");
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.МассивЗначений(СсылкаНаДокумент);
	ОбъектыПечати = Новый СписокЗначений;
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ТабДок.Очистить();
	
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
	
		ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОборотной(Команда)
	ПечатьОборотнойНаСервере();
КонецПроцедуры
