//++ Семенов Е.А. 12.11.2025

Перем ПечатьЧекЛиста;
Перем МаршрутныйЛист;
Перем ЭтоИГСАвто;
Перем ДанныеДляПечати;
Перем НаименованиеКонтрагентаСокращенное;
Перем КомпонентаПечатиШК;
Перем рсТранспортноеСредство;
Перем ОбъектПечати;  

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Наименование = "Путевой лист (внешний)";
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Информация = "Внешняя печатная форма для документа ""ПутевойЛист"". Задача № 2524 Профрешение";
	ПараметрыРегистрации.БезопасныйРежим = Ложь; 
	ПараметрыРегистрации.Назначение = ПолучитьНазначениеОбработки();
	ВызовСерверногоМетода = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Печатать весь путевой лист", "ВесьПутевойЛист", ВызовСерверногоМетода, Ложь, "ПечатьMXL"); 
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Печатать весь путевой лист и маршрутный лист", "ВесьПутевойЛистИМаршрутныйЛист", ВызовСерверногоМетода, Ложь, "ПечатьMXL"); 
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Печатать лицевую сторону путевого листа", "ЛицеваяСторонаПутевогоЛиста", ВызовСерверногоМетода, Ложь, "ПечатьMXL"); 
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Печатать оборотную сторону путевого листа", "ОборотнаяСторонаПутевогоЛиста", ВызовСерверногоМетода, Ложь, "ПечатьMXL"); 
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

функция ПолучитьНазначениеОбработки() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Документ.уатПутевойЛист");
	Возврат Массив;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры 

#КонецОбласти

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ТабличныйДокумент = СформироватьТабличныйДокумент(МассивОбъектов, КоллекцияПечатныхФорм[0].ИмяМакета); 
	
	Если КоллекцияПечатныхФорм[0].ИмяМакета = "ВесьПутевойЛист" Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВесьПутевойЛист", Нстр("ru = 'Печатать весь путевой лист'"), ТабличныйДокумент);
	ИначеЕсли КоллекцияПечатныхФорм[0].ИмяМакета = "ВесьПутевойЛистИМаршрутныйЛист" Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВесьПутевойЛистИМаршрутныйЛист", Нстр("ru = 'Печатать весь путевой лист и маршрутный лист'"), ТабличныйДокумент);
	ИначеЕсли КоллекцияПечатныхФорм[0].ИмяМакета = "ЛицеваяСторонаПутевогоЛиста" Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЛицеваяСторонаПутевогоЛиста", Нстр("ru = 'Печатать лицевую сторону путевого листа'"), ТабличныйДокумент);
	ИначеЕсли КоллекцияПечатныхФорм[0].ИмяМакета = "ОборотнаяСторонаПутевогоЛиста" Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОборотнаяСторонаПутевогоЛиста", Нстр("ru = 'Печатать оборотную сторону путевого листа'"), ТабличныйДокумент);
	Иначе
        Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗакэшироватьНеобходимыеДанные(СсылкаНаОбъект)//Тут собираем все необходимые данные для дальнейшего использования{СсылкаНаОбъект}
	
	//Путевой лист
	
	СтруктураДокументы = Новый Структура;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛист.ВидПЛ КАК ВидПЛ,
	|	уатПутевойЛист.Представление КАК Представление,
	|	уатПутевойЛист.Номер КАК Номер,
	|	уатПутевойЛист.Дата КАК Дата,
	|	уатПутевойЛист.ДатаВыезда КАК ДатаВыезда,
	|	уатПутевойЛист.ДействителенДо КАК ДействителенДо,
	|	уатПутевойЛист.Организация КАК Организация,
	|	уатПутевойЛист.ТранспортноеСредство КАК ТранспортноеСредство,
	|	уатПутевойЛист.Водитель1 КАК Водитель1,
	|	уатПутевойЛист.Водитель2 КАК Водитель2,
	|	уатПутевойЛист.ДатаВозвращения КАК ДатаВозвращения,
	|	уатПутевойЛист.СпидометрВыезда КАК СпидометрВыезда,
	|	уатПутевойЛист.ВыдалДиспетчер КАК ВыдалДиспетчер,
	|	уатПутевойЛист.ВыпустилМеханик КАК ВыпустилМеханик,
	|	уатПутевойЛист.ПринялМеханик КАК ПринялМеханик,
	|	уатПутевойЛист.Ссылка КАК Ссылка,
	|	уатПутевойЛист.СпидометрВозвращения КАК СпидометрВозвращения,
	|	уатПутевойЛист.ВыдатьКоличествоГорючего КАК ВыдатьКоличествоГорючего,
	|	уатПутевойЛист.ВыдатьГорючее КАК ВыдатьГорючее,
	|	уатПутевойЛист.МедработникВыезд КАК ОсмотрелВрач,
	|	уатПутевойЛист.Сотрудник1 КАК Сотрудник1,
	|	уатПутевойЛист.Сотрудник2 КАК Сотрудник2,
	|	уатПутевойЛист.НулевойПробегВыезда КАК НулевойПробегВыезда,
	|	уатПутевойЛист.НулевойПробегВозвращения КАК НулевойПробегВозвращения
	|ПОМЕСТИТЬ ВТПутевойЛист
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	уатПутевойЛист.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛистЗадание.ЗаказНаТС КАК ЗаказНаТС
	|ПОМЕСТИТЬ ВТТЧПутевойЛист
	|ИЗ
	|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
	|ГДЕ
	|	уатПутевойЛистЗадание.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказГрузоотправителя.Контрагент КАК Контрагент,
	|	уатЗаказГрузоотправителя.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТЗаказГрузоотправителю
	|ИЗ
	|	ВТТЧПутевойЛист КАК ВТТЧПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|		ПО ВТТЧПутевойЛист.ЗаказНаТС = уатЗаказГрузоотправителя.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ИНН КАК ИНН,
	|	Организации.Наименование КАК Наименование,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	Организации.КодПоОКПО КАК КодПоОКПО
	|ПОМЕСТИТЬ ВТОрганизация
	|ИЗ
	|	ВТПутевойЛист КАК ВТПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТПутевойЛист.Организация = Организации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ВТПутевойЛист.Водитель1 КАК Водитель1
	|ПОМЕСТИТЬ ВТВодитель1
	|ИЗ
	|	ВТПутевойЛист КАК ВТПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ВТПутевойЛист.Водитель1.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ВТПутевойЛист.Водитель2 КАК Водитель2
	|ПОМЕСТИТЬ ВТВодитель2
	|ИЗ
	|	ВТПутевойЛист КАК ВТПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ВТПутевойЛист.Водитель2.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПутевойЛист.ВидПЛ КАК ВидПЛ,
	|	ВТПутевойЛист.Представление КАК Представление,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТЗаказГрузоотправителю.Контрагент) = ТИП(Справочник.ПодразделенияОрганизаций)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СобственныеНужды,
	|	ВТПутевойЛист.Номер КАК Номер,
	|	ВТПутевойЛист.Дата КАК ДатаВыписки,
	|	ВТПутевойЛист.ДатаВыезда КАК ДатаВыезда,
	|	ВТПутевойЛист.ДействителенДо КАК ДействителенДо,
	|	ВТПутевойЛист.Организация КАК Организация,
	|	ВТПутевойЛист.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВТВодитель1.Ссылка КАК Водитель1,
	|	ВТВодитель1.СтраховойНомерПФР КАК Водитель1СтраховойНомерПФР,
	|	ВТВодитель2.Ссылка КАК Водитель2,
	|	ВТВодитель2.СтраховойНомерПФР КАК Водитель2СтраховойНомерПФР1,
	|	ВТПутевойЛист.ДатаВозвращения КАК ДатаВозвращения,
	|	ВТПутевойЛист.СпидометрВыезда КАК СпидометрВыезда,
	|	ВТПутевойЛист.ВыдалДиспетчер КАК ВыдалДиспетчер,
	|	ВТПутевойЛист.ВыпустилМеханик КАК ВыпустилМеханик,
	|	ВТПутевойЛист.ПринялМеханик КАК ПринялМеханик,
	|	ВТОрганизация.Ссылка КАК ОрганизацияСсылка,
	|	ВТОрганизация.ИНН КАК ОрганизацияИНН,
	|	ВТОрганизация.Наименование КАК ОрганизацияНаименование,
	|	ВТОрганизация.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	|	ВТОрганизация.КодПоОКПО КАК ОрганизацияКодПоОКПО,
	|	ВТПутевойЛист.СпидометрВозвращения КАК СпидометрВозвращения,
	|	ВТПутевойЛист.Сотрудник1 КАК Сотрудник1,
	|	ВТПутевойЛист.Сотрудник2 КАК Сотрудник2,
	|	ВТПутевойЛист.ОсмотрелВрач КАК ОсмотрелВрач,
	|	ВТПутевойЛист.ВыдатьГорючее КАК ВыдатьГорючее,
	|	ВТПутевойЛист.НулевойПробегВыезда КАК НулевойПробегВыезда,
	|	ВТПутевойЛист.НулевойПробегВозвращения КАК НулевойПробегВозвращения
	|ИЗ
	|	ВТПутевойЛист КАК ВТПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТЧПутевойЛист КАК ВТТЧПутевойЛист
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказГрузоотправителю КАК ВТЗаказГрузоотправителю
	|			ПО ВТТЧПутевойЛист.ЗаказНаТС = ВТЗаказГрузоотправителю.Ссылка
	|		ПО ВТПутевойЛист.Ссылка = ВТТЧПутевойЛист.ЗаказНаТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОрганизация КАК ВТОрганизация
	|		ПО ВТПутевойЛист.Организация = ВТОрганизация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВодитель1 КАК ВТВодитель1
	|		ПО ВТПутевойЛист.Водитель1 = ВТВодитель1.Водитель1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВодитель2 КАК ВТВодитель2
	|		ПО ВТПутевойЛист.Водитель2 = ВТВодитель2.Водитель2"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДокументы.Вставить("ПутевойЛист", Выборка); 
	КонецЦикла;
	
	//ТЧ Задание
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛистЗадание.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(уатПутевойЛистЗадание.НомерСтроки) КАК Количество,
	|	уатПутевойЛист.ВидПЛ КАК ВидПЛ,
	|	уатПутевойЛист.Представление КАК Представление,
	|	уатПутевойЛистЗадание.Контрагент КАК Контрагент,
	|	уатПутевойЛистЗадание.Подразделение КАК Подразделение,
	|	уатПутевойЛистЗадание.АдресПрибытия КАК АдресПрибытия,
	|	уатПутевойЛистЗадание.АдресУбытия КАК АдресУбытия,
	|	уатПутевойЛистЗадание.ВремяУбытия КАК ВремяУбытия,
	|	уатПутевойЛистЗадание.ВремяПрибытия КАК ВремяПрибытия
	|ИЗ
	|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПутевойЛист КАК уатПутевойЛист
	|		ПО уатПутевойЛистЗадание.Ссылка = уатПутевойЛист.Ссылка
	|ГДЕ
	|	уатПутевойЛистЗадание.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уатПутевойЛистЗадание.Ссылка,
	|	уатПутевойЛист.ВидПЛ,
	|	уатПутевойЛист.Представление,
	|	уатПутевойЛистЗадание.Контрагент,
	|	уатПутевойЛистЗадание.Подразделение,
	|	уатПутевойЛистЗадание.АдресПрибытия,
	|	уатПутевойЛистЗадание.АдресУбытия,
	|	уатПутевойЛистЗадание.ВремяУбытия,
	|	уатПутевойЛистЗадание.ВремяПрибытия";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДокументы.Вставить("Задание", Выборка); 
	КонецЦикла;
	
	//ТЧ РасходГСМ
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛистРасходГСМ.ТС КАК ТС,
	|	уатПутевойЛистРасходГСМ.ГСМ КАК ГСМ,
	|	уатПутевойЛистРасходГСМ.ОстатокПриВыезде КАК ОстатокПриВыезде,
	|	уатПутевойЛистРасходГСМ.ОстатокПриВозвращении КАК ОстатокПриВозвращении
	|ИЗ
	|	Документ.уатПутевойЛист.РасходГСМ КАК уатПутевойЛистРасходГСМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПутевойЛист КАК уатПутевойЛист
	|		ПО уатПутевойЛистРасходГСМ.Ссылка = уатПутевойЛист.Ссылка
	|ГДЕ
	|	уатПутевойЛист.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выгрузить();
	СтруктураДокументы.Вставить("РасходГСМ", Выборка); 
	
	//Прицепы
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛистПрицепы.ТС КАК ТС
	|ИЗ
	|	Документ.уатПутевойЛист.Прицепы КАК уатПутевойЛистПрицепы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПутевойЛист КАК уатПутевойЛист
	|		ПО уатПутевойЛистПрицепы.Ссылка = уатПутевойЛист.Ссылка
	|ГДЕ
	|	уатПутевойЛист.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выгрузить();
	СтруктураДокументы.Вставить("Прицепы", Выборка); 
	
	//Удостоверение водителя1 
	ВидыДокументов = Новый СписокЗначений;
	//Тут спросить как вытянуть через БСП
	ВидыДокументов.Добавить(Справочники.уатВидыДокументов.УдостоверениеВодителя);
	ВидыДокументов.Добавить(Справочники.уатВидыДокументов.УдостоверениеМашинистаТракториста);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ВидыДокументов", ВидыДокументов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(уатПутевойЛист.Водитель1, НЕОПРЕДЕЛЕНО) КАК Водитель1,
	|	ЕСТЬNULL(уатПутевойЛист.Водитель2, НЕОПРЕДЕЛЕНО) КАК Водитель2
	|ПОМЕСТИТЬ ВТПутевойЛист
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	уатПутевойЛист.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЕСТЬNULL(уатДокументыВодителей.ВладелецДокументов, НЕОПРЕДЕЛЕНО) КАК Сотрудник,
	|	ЕСТЬNULL(уатДокументыВодителей.Серия, НЕОПРЕДЕЛЕНО) КАК Серия,
	|	ЕСТЬNULL(уатДокументыВодителей.Номер, НЕОПРЕДЕЛЕНО) КАК Номер,
	|	ЕСТЬNULL(уатДокументыВодителей.ДатаВыдачи, НЕОПРЕДЕЛЕНО) КАК ДатаВыдачи,
	|	ЕСТЬNULL(ВТПутевойЛист.Водитель1, НЕОПРЕДЕЛЕНО) КАК Водитель1,
	|	ЕСТЬNULL(уатРегистрационныеДокументыКатегории.Категория, НЕОПРЕДЕЛЕНО) КАК Категория
	|ПОМЕСТИТЬ ВТВодитель1
	|ИЗ
	|	ВТПутевойЛист КАК ВТПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатРегистрационныеДокументы КАК уатДокументыВодителей
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатРегистрационныеДокументы.Категории КАК уатРегистрационныеДокументыКатегории
	|			ПО (уатРегистрационныеДокументыКатегории.Ссылка = уатДокументыВодителей.Ссылка)
	|		ПО ВТПутевойЛист.Водитель1 = уатДокументыВодителей.ВладелецДокументов
	|ГДЕ
	|	уатДокументыВодителей.ВидДокумента В(&ВидыДокументов)
	|	И уатДокументыВодителей.ПринадлежностьДокументов = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьДокументов.ДокументыВодителя)
	|	И НЕ уатДокументыВодителей.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЕСТЬNULL(уатДокументыВодителей.ВладелецДокументов, НЕОПРЕДЕЛЕНО) КАК Сотрудник,
	|	ЕСТЬNULL(уатДокументыВодителей.Серия, НЕОПРЕДЕЛЕНО) КАК Серия,
	|	ЕСТЬNULL(уатДокументыВодителей.Номер, НЕОПРЕДЕЛЕНО) КАК Номер,
	|	ЕСТЬNULL(уатДокументыВодителей.ДатаВыдачи, НЕОПРЕДЕЛЕНО) КАК ДатаВыдачи,
	|	ЕСТЬNULL(ВТПутевойЛист.Водитель2, НЕОПРЕДЕЛЕНО) КАК Водитель2,
	|	ЕСТЬNULL(уатРегистрационныеДокументыКатегории.Категория, НЕОПРЕДЕЛЕНО) КАК Категория
	|ПОМЕСТИТЬ ВТВодитель2
	|ИЗ
	|	ВТПутевойЛист КАК ВТПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатРегистрационныеДокументы КАК уатДокументыВодителей
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатРегистрационныеДокументы.Категории КАК уатРегистрационныеДокументыКатегории
	|			ПО (уатРегистрационныеДокументыКатегории.Ссылка = уатДокументыВодителей.Ссылка)
	|		ПО ВТПутевойЛист.Водитель2 = уатДокументыВодителей.ВладелецДокументов
	|ГДЕ
	|	уатДокументыВодителей.ВидДокумента В(&ВидыДокументов)
	|	И уатДокументыВодителей.ПринадлежностьДокументов = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьДокументов.ДокументыВодителя)
	|	И НЕ уатДокументыВодителей.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТВодитель1.Водитель1, НЕОПРЕДЕЛЕНО) КАК Водитель,
	|	ЕСТЬNULL(ВТВодитель1.Серия, НЕОПРЕДЕЛЕНО) КАК Серия,
	|	ЕСТЬNULL(ВТВодитель1.Номер, НЕОПРЕДЕЛЕНО) КАК Номер,
	|	ЕСТЬNULL(ВТВодитель1.ДатаВыдачи, НЕОПРЕДЕЛЕНО) КАК ДатаВыдачи,
	|	ЕСТЬNULL(ВТВодитель1.Категория, НЕОПРЕДЕЛЕНО) КАК Категория
	|ИЗ
	|	ВТВодитель1 КАК ВТВодитель1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТВодитель2.Водитель2,
	|	ВТВодитель2.Серия,
	|	ВТВодитель2.Номер,
	|	ВТВодитель2.ДатаВыдачи,
	|	ВТВодитель2.Категория
	|ИЗ
	|	ВТВодитель2 КАК ВТВодитель2";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Попытка
		СтруктураДокументы.Вставить("УдостоверенияВодителя1", Выборка[0]);
	Исключение
		СтруктураДокументы.Вставить("УдостоверенияВодителя1", Новый Структура("Водитель, Серия, Номер, ДатаВыдачи, Категория",,,,,));
	КонецПопытки;	
	Попытка
		СтруктураДокументы.Вставить("УдостоверенияВодителя2", Выборка[1]);
	Исключение
		СтруктураДокументы.Вставить("УдостоверенияВодителя2", Новый Структура("Водитель, Серия, Номер, ДатаВыдачи, Категория",,,,,));
	КонецПопытки;
	ОбъектПечати = СтруктураДокументы;
	
КонецПроцедуры

Функция СформироватьТабличныйДокумент(МассивОбъектов, КоллекцияПечатныхФорм)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСнизу = 5;
	
	Для Каждого мОбъект из МассивОбъектов Цикл
		СсылкаНаОбъект = мОбъект;
		ЗакэшироватьНеобходимыеДанные(СсылкаНаОбъект);
		Попытка
			Выборка = ОбъектПечати.Задание; 
			Если Выборка.Количество = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не заполнена таблица заданий в документе " + Выборка.Представление);
				Возврат Неопределено;
			КонецЕсли;
			
			ПечатьЧекЛиста = Ложь;
			МаршрутныйЛист = Ложь;
			
			ВидПЛ = Выборка.ВидПЛ;
			
			Если ВидПЛ = Перечисления.уатВидыПЛ._4П Тогда
				ПечатьЧекЛиста = Истина;
			КонецЕсли;
			
			Если КоллекцияПечатныхФорм = "ВесьПутевойЛистИМаршрутныйЛист" Тогда
				МаршрутныйЛист = Истина;
			КонецЕсли;
			
			ЗаполнитьДанныеДляПечати(СсылкаНаОбъект);
			
			ИмяМакета = Неопределено;
			Если ВидПЛ = Перечисления.уатВидыПЛ._3 Тогда
				ИмяМакета = "_3";
			ИначеЕсли ВидПЛ = Перечисления.уатВидыПЛ._6С Тогда
				ИмяМакета = "_6С";
			ИначеЕсли ВидПЛ = Перечисления.уатВидыПЛ._4П Тогда
				ИмяМакета = "_4П";	
			ИначеЕсли ВидПЛ = Перечисления.уатВидыПЛ._3спец Тогда
				ИмяМакета = "_3спец";
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Выбран некорректный Вид ПЛ");
				ТабличныйДокументы = Новый ТабличныйДокумент;
				Возврат ТабличныйДокументы;
			КонецЕсли;	
			
			Если КоллекцияПечатныхФорм = "ВесьПутевойЛист" Или КоллекцияПечатныхФорм = "ВесьПутевойЛистИМаршрутныйЛист" Или (КоллекцияПечатныхФорм = "ВесьПутевойЛист" И ПечатьЧекЛиста) Тогда
				Если (ИмяМакета = "_3") Или (ИмяМакета = "_6С") Или (ИмяМакета = "_4П") Или (ИмяМакета = "_3спец") Тогда 
					ИмяФункцииПечати = "уатПечать" + ИмяМакета + "(ИмяМакета, 0)";
				Иначе	
					ТабличныйДокументы = Новый ТабличныйДокумент;
					Возврат ТабличныйДокументы;
					
				КонецЕсли;	
				ТабДокумент = Вычислить(ИмяФункцииПечати);
				
			ИначеЕсли КоллекцияПечатныхФорм = "ЛицеваяСторонаПутевогоЛиста" Тогда
				Если (ИмяМакета = "_3") Или (ИмяМакета = "_6С") Или (ИмяМакета = "_4П") Или (ИмяМакета = "_3спец") Тогда
					ИмяФункцииПечати = "уатПечать" + ИмяМакета + "(ИмяМакета, 1)";
				Иначе	
					ТабличныйДокументы = Новый ТабличныйДокумент;
					Возврат ТабличныйДокументы;
					
				КонецЕсли;	
				ТабДокумент = Вычислить(ИмяФункцииПечати);
			ИначеЕсли КоллекцияПечатныхФорм = "ОборотнаяСторонаПутевогоЛиста" Тогда
				Если (ИмяМакета = "_3") Или (ИмяМакета = "_6С") Или (ИмяМакета = "_4П") Или (ИмяМакета = "_3спец") Тогда
					ИмяФункцииПечати = "уатПечать" + ИмяМакета + "(ИмяМакета, 2)";
				Иначе	
					ТабличныйДокументы = Новый ТабличныйДокумент;
					Возврат ТабличныйДокументы;
					
				КонецЕсли;	
				ТабДокумент = Вычислить(ИмяФункцииПечати);
			КонецЕсли;
			
			Попытка
				ТабДокумент.Рисунки.Удалить(ТабДокумент.Рисунки.ДополнительныеДанные);
			Исключение
			КонецПопытки;
			
			Попытка
				ТабДокумент.Рисунки.ИнформацияОФормировании.Текст = "Сформирован " + СокрЛП(ТекущаяДата()); 
			Исключение
			КонецПопытки;
			
		Исключение
		КонецПопытки;
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ЗаполнитьДанныеДляПечати(СсылкаНаОбъект)
	
	ЭтоИГСАвто = (СокрЛП(ОбъектПечати.ПутевойЛист.ОрганизацияИНН) = "8911028380");
	
	ЕстьРаботаНаСобственныеНужды = Ложь;
	ВидСообщения = "";
	
	ЕстьРаботаНаСобственныеНужды = ЕстьРаботаНаСобственныеНужды ИЛИ ОбъектПечати.ПутевойЛист.СобственныеНужды;
	Если ПустаяСтрока(ВидСообщения) Тогда
		ВидСообщения = "";
	КонецЕсли;
	
	ДанныеДляПечати = Новый Структура;
	Если ОбъектПечати.ПутевойЛист.ВидПЛ = Перечисления.уатВидыПЛ._3спец Тогда
		ВидПеревозки = "передвижение и работа спец. ТС";
	ИначеЕсли ЕстьРаботаНаСобственныеНужды Тогда
		ВидПеревозки = "перевозки для собственных нужд";
	Иначе
		ВидПеревозки = "коммерческие перевозки";
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ВидПеревозки", "Вид перевозки: " + ВидПеревозки);
	ДанныеДляПечати.Вставить("ВидСообщения", "Вид сообщения: " + ?(ПустаяСтрока(ВидСообщения), "пригородное", нрег(ВидСообщения)));
	
	ДанныеДляПечати.Вставить("ШтрихКод", ПолучитьШтрихкод());
	
	ФорматДаты = "ДФ='дд ММММ гггг'";
	ДанныеДляПечати.Вставить("Номер", СокрЛП(ОбъектПечати.ПутевойЛист.Номер));
	ДанныеДляПечати.Вставить("ДатаВыписки", Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, ФорматДаты));
	ДанныеДляПечати.Вставить("СрокДействия", "Срок действия с: " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, ФорматДаты) + " по " + Формат(ОбъектПечати.ПутевойЛист.ДействителенДо, ФорматДаты));
	
	ДанныеДляПечати.Вставить("Организация", СформироватьНаименованиеОрганизации(ОбъектПечати.ПутевойЛист.ОрганизацияСсылка));
	ДанныеДляПечати.Вставить("ОрганизацияКратко", ?(ПустаяСтрока(ОбъектПечати.ПутевойЛист.ОрганизацияНаименованиеСокращенное), СокрЛП(ОбъектПечати.ПутевойЛист.ОрганизацияНаименование), СокрЛП(ОбъектПечати.ПутевойЛист.ОрганизацияНаименованиеСокращенное)));
	
	ДанныеДляПечати.Вставить("КодПоОКПО", СокрЛП(ОбъектПечати.ПутевойЛист.ОрганизацияКодПоОКПО));
	
	ДанныеДляПечати.Вставить("ТранспортноеСредство", ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
	рсТранспортноеСредство = уатПрочитатьРеквизитыТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
	мМодельТранспортноеСредство = рсТранспортноеСредство.Модель;
	
	ДанныеДляПечати.Вставить("МодельТС", уатОбщегоНазначения.уатПредставлениеМоделиТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство));
	
	Если ЭтоИГСАвто И
		ЗначениеЗаполнено(мМодельТранспортноеСредство.прНоменклатураУслуги) Тогда
		ТипТС = мМодельТранспортноеСредство.прНоменклатураУслуги;
	ИначеЕсли ЗначениеЗаполнено(мМодельТранспортноеСредство) Тогда
		ТипТС = мМодельТранспортноеСредство.ТипТС;
	Иначе
		ТипТС = "";
	КонецЕсли;
	ДанныеДляПечати.Вставить("ТипТС", ТипТС);
	
	ДанныеДляПечати.Вставить("ГосударственныйНомер", рсТранспортноеСредство.ГосударственныйНомер);
	ДанныеДляПечати.Вставить("ГаражныйНомер", рсТранспортноеСредство.ГаражныйНомер);
	
	мРеквизитыВодителя1 		= уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ОбъектПечати.ПутевойЛист.Водитель1, ОбъектПечати.ПутевойЛист.ДатаВыписки);
	ДанныеДляПечати.Вставить("ТабельныйНомер", мРеквизитыВодителя1.ТабельныйНомер);
	
	ДанныеДляПечати.Вставить("НомерУдостоверенияВодителя", ?(ПустаяСтрока(ОбъектПечати.УдостоверенияВодителя1.Серия), "", СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия) + " ") + ОбъектПечати.УдостоверенияВодителя1.Номер + " от " + Формат(ОбъектПечати.УдостоверенияВодителя1.ДатаВыдачи, "ДФ=dd.MM.yy"));
	
	ДанныеДляПечати.Вставить("Водитель", СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1));
	ДанныеДляПечати.Вставить("ВодительСокр", уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Водитель1));
	ДанныеДляПечати.Вставить("СНИЛС", СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1СтраховойНомерПФР));
	
	Если ЗначениеЗаполнено(ОбъектПечати.ПутевойЛист.Водитель2) Тогда
		ДанныеДляПечати.Вставить("Водитель", СокрЛП(ДанныеДляПечати.Водитель) + ", " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель2));
		
		ДанныеДляПечати.Вставить("НомерУдостоверенияВодителя", СокрЛП(ДанныеДляПечати.НомерУдостоверенияВодителя) + ", " + ?(ПустаяСтрока(ОбъектПечати.УдостоверенияВодителя2.Серия), "", СокрЛП(ОбъектПечати.УдостоверенияВодителя2.Серия) + " ") + ОбъектПечати.УдостоверенияВодителя2.Номер + " от " + Формат(ОбъектПечати.УдостоверенияВодителя1.ДатаВыдачи, "ДФ=dd.MM.yy"));
		
		ДанныеДляПечати.Вставить("СНИЛС", СокрЛП(ДанныеДляПечати.СНИЛС) + ", " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель2.СтраховойНомерПФР));
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ВремяВыезда", Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, "ДФ=ЧЧ:мм"));
	ДанныеДляПечати.Вставить("ВремяВыезда_Час", Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, "ДФ=ЧЧ"));
	ДанныеДляПечати.Вставить("ВремяВыезда_Мин", Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, "ДФ=мм"));
	ДанныеДляПечати.Вставить("ВремяВыезда_Ден", Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, "ДФ=дд"));
	ДанныеДляПечати.Вставить("ВремяВыезда_Мес", Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, "ДФ=ММ"));
	
	ДанныеДляПечати.Вставить("ВремяВозврата", Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения, "ДФ=ЧЧ:мм"));
	ДанныеДляПечати.Вставить("ВремяВозврата_Час", Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения, "ДФ=ЧЧ"));
	ДанныеДляПечати.Вставить("ВремяВозврата_Мин", Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения, "ДФ=мм"));
	ДанныеДляПечати.Вставить("ВремяВозврата_Ден", Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения, "ДФ=дд"));
	ДанныеДляПечати.Вставить("ВремяВозврата_Мес", Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения, "ДФ=ММ"));
	
	ДанныеДляПечати.Вставить("СпидометрВыезда", Формат(ОбъектПечати.ПутевойЛист.СпидометрВыезда, "ЧГ="));
	
	ДанныеДляПечати.Вставить("Диспетчер", уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыдалДиспетчер));
	ДанныеДляПечати.Вставить("ВыпустилМеханик", уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыпустилМеханик));
	ДанныеДляПечати.Вставить("ПринялМеханик", уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ПринялМеханик));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛистПрицепы.ТС КАК ТС
	|ИЗ
	|	Документ.уатПутевойЛист.Прицепы КАК уатПутевойЛистПрицепы
	|ГДЕ
	|	уатПутевойЛистПрицепы.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		рсПрицеп = уатПрочитатьРеквизитыТС(Выборка.ТС);
		ДанныеДляПечати.Вставить("ПрицепМодельТС", уатОбщегоНазначения.уатПредставлениеМоделиТС(Выборка.ТС));
		ДанныеДляПечати.Вставить("ПрицепГосударственныйНомер", рсПрицеп.ГосударственныйНомер);
		ДанныеДляПечати.Вставить("ПрицепГаражныйНомер", рсПрицеп.ГаражныйНомер);
	Иначе
		ДанныеДляПечати.Вставить("ПрицепМодельТС", "");
		ДанныеДляПечати.Вставить("ПрицепГосударственныйНомер", "");
		ДанныеДляПечати.Вставить("ПрицепГаражныйНомер", "");
	КонецЕсли;;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛистРасходГСМ.ГСМ КАК ГСМ,
	|	уатПутевойЛистРасходГСМ.ОстатокПриВыезде КАК ОстатокПриВыезде
	|ИЗ
	|	Документ.уатПутевойЛист.РасходГСМ КАК уатПутевойЛистРасходГСМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатПутевойЛист КАК уатПутевойЛист
	|		ПО уатПутевойЛистРасходГСМ.Ссылка = уатПутевойЛист.Ссылка
	|			И (уатПутевойЛист.ТранспортноеСредство = уатПутевойЛистРасходГСМ.ТС)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатТС КАК уатТС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатМоделиТС КАК уатМоделиТС
	|			ПО уатТС.Модель = уатМоделиТС.Ссылка
	|		ПО уатПутевойЛистРасходГСМ.ТС = уатТС.Ссылка
	|ГДЕ
	|	уатМоделиТС.ОсновноеТопливо = уатПутевойЛистРасходГСМ.ГСМ";
	Выборка = Запрос.Выполнить().Выбрать();
	ДанныеДляПечати.Вставить("ГСМ", "");
	ДанныеДляПечати.Вставить("ОстатокПриВыезде", "");
	Если Выборка.Следующий() Тогда
		ДанныеДляПечати.Вставить("ГСМ", Выборка.ГСМ);
		ДанныеДляПечати.Вставить("ОстатокПриВыезде", Выборка.ОстатокПриВыезде);
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Заявка", "");
	ДанныеДляПечати.Вставить("Контрагент", "");
	ДанныеДляПечати.Вставить("Маршрут", "");
	ДанныеДляПечати.Вставить("Проект", "");
	ДанныеДляПечати.Вставить("ОбъектЗатрат", "");
	ДанныеДляПечати.Вставить("Куст", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛистЗадание.Контрагент КАК Контрагент,
	|	уатПутевойЛистЗадание.Маршрут КАК Маршрут,
	|	уатПутевойЛистЗадание.пр_Проект КАК пр_Проект,
	|	уатПутевойЛистЗадание.пр_ОбъектЗатрат КАК пр_ОбъектЗатрат,
	|	уатПутевойЛистЗадание.ЗаказНаТС КАК ЗаказНаТС
	|ПОМЕСТИТЬ ВТОснова
	|ИЗ
	|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
	|ГДЕ
	|	уатПутевойЛистЗадание.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(НоменклатурныеГруппы.Родитель, """") КАК Родитель1,
	|	ЕСТЬNULL(НоменклатурныеГруппы.Родитель.Родитель, """") КАК Родитель2,
	|	ЕСТЬNULL(НоменклатурныеГруппы.Родитель.Родитель.Родитель, """") КАК Родитель3,
	|	ЕСТЬNULL(НоменклатурныеГруппы.Родитель.Родитель.Родитель.Родитель, """") КАК Родитель4,
	|	ЕСТЬNULL(НоменклатурныеГруппы.Родитель.Родитель.Родитель.Родитель.Родитель, """") КАК Родитель5,
	|	ЕСТЬNULL(НоменклатурныеГруппы.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель, """") КАК Родитель6,
	|	ЕСТЬNULL(НоменклатурныеГруппы.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель, """") КАК Родитель7,
	|	ВТОснова.пр_ОбъектЗатрат КАК пр_ОбъектЗатрат
	|ПОМЕСТИТЬ ВТКуст
	|ИЗ
	|	ВТОснова КАК ВТОснова
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|		ПО ВТОснова.пр_ОбъектЗатрат = НоменклатурныеГруппы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТОснова.Контрагент КАК Контрагент,
	|	ВТОснова.Маршрут КАК Маршрут,
	|	ВТОснова.пр_Проект КАК пр_Проект,
	|	ВТОснова.пр_ОбъектЗатрат КАК пр_ОбъектЗатрат,
	|	ВТОснова.ЗаказНаТС КАК ЗаказНаТС,
	|	ВЫБОР
	|		КОГДА ВТКуст.Родитель5 <> """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВТКуст.Родитель5.Ссылка = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|						ТОГДА ВТКуст.Родитель1.Ссылка
	|					ИНАЧЕ ВТКуст.Родитель2.Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Куст
	|ИЗ
	|	ВТОснова КАК ВТОснова
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКуст КАК ВТКуст
	|		ПО ВТОснова.пр_ОбъектЗатрат = ВТКуст.пр_ОбъектЗатрат";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда		
			Если НЕ ВыборкаДетальныеЗаписи.ЗаказНаТС = Документы.уатЗаказГрузоотправителя.ПустаяСсылка() Тогда
				Заявка = "№";
			КонецЕсли;
			
			ДанныеДляПечати.Вставить("Заявка", Заявка);
			ДанныеДляПечати.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
			ДанныеДляПечати.Вставить("Маршрут", ВыборкаДетальныеЗаписи.Маршрут);
			ДанныеДляПечати.Вставить("Проект", ВыборкаДетальныеЗаписи.пр_Проект);
			ДанныеДляПечати.Вставить("ОбъектЗатрат", ВыборкаДетальныеЗаписи.пр_ОбъектЗатрат);
			ДанныеДляПечати.Вставить("Куст", ВыборкаДетальныеЗаписи.Куст);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 	

Функция СформироватьНаименованиеОрганизации(Орг)
	Результат = Орг.Наименование;
	
	Если Орг.ВариантНаименованияДляПечатныхФорм = Перечисления.ВариантыНаименованияДляПечатныхФорм.ПолноеНаименование Тогда
		Результат = СокрЛП(Орг.НаименованиеПолное);
	ИначеЕсли Орг.ВариантНаименованияДляПечатныхФорм = Перечисления.ВариантыНаименованияДляПечатныхФорм.СокращенноеНаименование Тогда 
		Результат = СокрЛП(Орг.НаименованиеСокращенное);
	КонецЕсли; 
	
	Результат = Результат + ", ОГРН " + Орг.ОГРН;
	Результат = Результат + ", " + ОписаниеОрганизации(СведенияОЮрФизЛице(Орг, ОбъектПечати.ПутевойЛист.ДатаВыписки), "Наименование,ЮридическийАдрес,Телефоны");
	
	Возврат Результат;
КонецФункции 

Функция уатПечать_3(ИмяМакета, ФлагПечати="") Экспорт	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист_ПутевойЛист";
	
	Если ЭтоИГСАвто Тогда
		Макет = ПолучитьМакет("_3_новый");
		
		Если ФлагПечати <> 2 Тогда
			Область = Макет.ПолучитьОбласть("Лицевая");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			
			Попытка
				РисунокШтрихКод = Область.Рисунки.шк;
				СистемнаяИнформация = Новый СистемнаяИнформация;
				ТипПлатформыКомпоненты = Строка(СистемнаяИнформация.ТипПлатформы);
				КомпонентаПечатиШК = ГенерацияШтрихкодаСерверПовтИсп.ПодключитьКомпонентуГенерацииИзображенияШтрихкода(ТипПлатформыКомпоненты);
				Если КомпонентаПечатиШК = Неопределено ИЛИ
					НЕ ЗначениеЗаполнено(ДанныеДляПечати.ШтрихКод) Тогда
					Область.Рисунки.Удалить(РисунокШтрихКод);
				Иначе
					РисунокШтрихКод.ВыводитьНаПечать = Истина;
					
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина); 
					ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота); 
					ПараметрыШтрихкода.Вставить("Штрихкод", ДанныеДляПечати.ШтрихКод);
					ПараметрыШтрихкода.Вставить("ТипКода", 1);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
					ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
					
					РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			ТабДокумент.Вывести(Область);
		КонецЕсли;
		
		Если ФлагПечати = 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если ФлагПечати <> 1 Тогда
			
			Область = Макет.ПолучитьОбласть("Оборотная");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			ТабДокумент.Вывести(Область);
			
		КонецЕсли;
		
		Если МаршрутныйЛист Тогда
			ПечатьМаршрутногоЛиста_Новый(ТабДокумент);
		КонецЕсли;
		
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ТабДокумент.ПолеСверху 	= 0;
		ТабДокумент.ПолеСлева 	= 0;
		ТабДокумент.ПолеСнизу 	= 0;
		ТабДокумент.ПолеСправа 	= 0;
		
		Возврат ТабДокумент;
	КонецЕсли;
		
	Макет = ПолучитьМакет(ИмяМакета);
	
	рсТранспортноеСредство = уатПрочитатьРеквизитыТС(ДанныеДляПечати.ТранспортноеСредство);
	мМодельТранспортноеСредство = рсТранспортноеСредство.Модель;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент.ПолеСверху 	= 0;
	ТабДокумент.ПолеСлева 	= 0;
	ТабДокумент.ПолеСнизу 	= 0;
	ТабДокумент.ПолеСправа 	= 0;
	
	Если ФлагПечати <> 2 Тогда
		Обл = Макет.ПолучитьОбласть("Лицевая");
		
		Попытка
			ШтрихКод = ПолучитьШтрихкод();
			РисунокШтрихКод = Обл.Рисунки.шк;
			Если КомпонентаПечатиШК = Неопределено ИЛИ
				НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
				Обл.Рисунки.Удалить(РисунокШтрихКод);
			Иначе
				РисунокШтрихКод.ВыводитьНаПечать = Истина;
				
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина);
				ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота);
				ПараметрыШтрихкода.Вставить("Штрихкод", ШтрихКод);
				ПараметрыШтрихкода.Вставить("ТипКода", 1);
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
				ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
				
				РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Обл.Параметры.ВидСообщения = ДанныеДляПечати.ВидСообщения;
		Обл.Параметры.ВидПеревозки = ДанныеДляПечати.ВидПеревозки;
		
		мНомерПЛ = СокрЛП(ДанныеДляПечати.Номер);
		Обл.Параметры.Номер = мНомерПЛ;
		ФорматДаты = "ДФ='дд ММММ гггг'";
		Обл.Параметры.ДатаВыписки = Формат(ДанныеДляПечати.ДатаВыписки, ФорматДаты);
		
		Обл.Параметры.ТекстДействителенДо = "Срок действия с: " + Формат(ДанныеДляПечати.ДатаВыезда, ФорматДаты) + " по " + Формат(ДанныеДляПечати.ДействителенДо, ФорматДаты);
		
		Обл.Параметры.ОрганизацияКр = СформироватьНаименованиеОрганизации(ДанныеДляПечати.Организация);
		Обл.Параметры.КодПоОКПО = ДанныеДляПечати.ОрганизацияКодПоОКПО;
		Обл.Параметры.МодельТС = уатОбщегоНазначения.уатПредставлениеМоделиТС(рсТранспортноеСредство);
		Если ЗначениеЗаполнено(мМодельТранспортноеСредство) Тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.ТипТС;
		КонецЕсли;
		
		Если СокрЛП(ДанныеДляПечати.ОрганизацияИНН) = "8911028380" И
			ЗначениеЗаполнено(мМодельТранспортноеСредство.прНоменклатураУслуги) Тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.прНоменклатураУслуги;
		КонецЕсли;
		
		Обл.Параметры.ТранспортноеСредствоГосНомер = рсТранспортноеСредство.ГосударственныйНомер;
		Обл.Параметры.ТранспортноеСредствоГарНомер = рсТранспортноеСредство.ГаражныйНомер;
		
		Обл.Параметры.Водители = "" + ДанныеДляПечати.Водитель1;
		Если ДанныеДляПечати.ДатаВыписки >= '20230901' Тогда
			Обл.Параметры.Водители = Обл.Параметры.Водители + ", СНИЛС " + СокрЛП(ДанныеДляПечати.Водитель1СтраховойНомерПФР);
		КонецЕсли;
		
		мРеквизитыВодителя1 = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ДанныеДляПечати.Водитель1, ДанныеДляПечати.ДатаВыписки);
		Обл.Параметры.ВодительКод = мРеквизитыВодителя1.ТабельныйНомер;
		Обл.Параметры.КлассВодителя = мРеквизитыВодителя1.Класс;
		
		Обл.Параметры.НомерУдостоверенияВодителя = ?(СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия)="","",СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия) + " ") + ОбъектПечати.УдостоверенияВодителя1.Номер;
		Если ДанныеДляПечати.ДатаВыписки >= '20230901' Тогда
			Обл.Параметры.НомерУдостоверенияВодителя = Обл.Параметры.НомерУдостоверенияВодителя + " от " + Формат(ОбъектПечати.УдостоверенияВодителя1.ДатаВыдачи, "ДФ=dd.MM.yy");
		КонецЕсли;
		
		Обл.Параметры.ЛицензионнаяКарточка = рсТранспортноеСредство.ЛицензионнаяКарточка;
		Обл.Параметры.НомерЛицензионнойКарточки = рсТранспортноеСредство.НомерЛицензионнойКарточки;
		Обл.Параметры.СерияЛицензионнойКарточки = рсТранспортноеСредство.СерияЛицензионнойКарточки;
		Обл.Параметры.НомерСерииЛицензионнойКарточки = рсТранспортноеСредство.НомерСерииЛицензионнойКарточки;
		
		Обл.Параметры.ВремяВыезда = Формат(ДанныеДляПечати.ДатаВыезда,"ДФ=ЧЧ:мм");
		Обл.Параметры.ВремяВозврата	= Формат(ДанныеДляПечати.ДатаВозвращения,"ДФ=ЧЧ:мм");
		Обл.Параметры.СпидометрВыезда = ДанныеДляПечати.СпидометрВыезда;
		Обл.Параметры.СпидометрВозвращения = ?(ДанныеДляПечати.СпидометрВозвращения = 0, "", ОбъектПечати.ПутевойЛист.СпидометрВозвращения);
		Для Каждого ТекСтрока из ОбъектПечати.РасходГСМ Цикл
			рсТС = уатПрочитатьРеквизитыТС(ТекСтрока.ТС);
			Если ТекСтрока.ТС = ОбъектПечати.ПутевойЛист.ТранспортноеСредство Тогда
				Если ТекСтрока.ГСМ = рсТС.Модель.ОсновноеТопливо Тогда
					Обл.Параметры.ГСМ1 = ТекСтрока.ГСМ;
					Обл.Параметры.ОстатокПриВыезде1	= ТекСтрока.ОстатокПриВыезде;
					
					Попытка
						Обл.Параметры.ОстатокПриВозвращении1 = ?(ТекСтрока.ОстатокПриВозвращении = 0, "", ТекСтрока.ОстатокПриВозвращении);
					Исключение
					КонецПопытки;
					
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		Обл.Параметры.ВыдалДиспетчер	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ДанныеДляПечати.ВыдалДиспетчер);
		Обл.Параметры.ВыпустилМеханик	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ДанныеДляПечати.ВыпустилМеханик);
		Обл.Параметры.ПринялМеханик		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ДанныеДляПечати.ПринялМеханик);
		Обл.Параметры.ВодительСдал		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ДанныеДляПечати.Водитель1);
		Обл.Параметры.ВодительПринял	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ДанныеДляПечати.Водитель1);
		Обл.Параметры.ОсмотрелВрач	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ДанныеДляПечати.ОсмотрелВрач);
		
		Если ОбъектПечати.Задание.Количество() > 0 Тогда
			ТекСтрока =  ОбъектПечати.Задание[0]; 
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Параметры.ВРаспоряжение	= ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
				Обл.Параметры.Заказчик = ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Параметры.ВРаспоряжение	= ТекСтрока.Подразделение.Наименование;
				Обл.Параметры.Заказчик = ТекСтрока.Подразделение.Наименование;
			КонецЕсли;	
			Обл.Параметры.АдресПрибытия	= ПредставлениеАдреса(ТекСтрока.АдресПрибытия);
			Обл.Параметры.АдресУбытия = ПредставлениеАдреса(ТекСтрока.АдресУбытия);
		КонецЕсли;
		
		ТабДокумент.Вывести(Обл);
	КонецЕсли;
	
	Если ФлагПечати = 0 Тогда	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если ФлагПечати <> 1 Тогда
		
		Обл = Макет.ПолучитьОбласть("Оборотная");
		
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	Если МаршрутныйЛист Тогда
		ПечатьМаршрутногоЛиста(ТабДокумент, Макет);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция уатПечать_3Спец(ИмяМакета, ФлагПечати="") Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист_ПутевойЛист";
	
	Если ЭтоИГСАвто Тогда
		Макет = ПолучитьМакет("_3спец_новый");
		
		Если ФлагПечати <> 2 Тогда
			Область = Макет.ПолучитьОбласть("Лицевая");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			
			Попытка
				РисунокШтрихКод = Область.Рисунки.шк;
				СистемнаяИнформация = Новый СистемнаяИнформация;
				ТипПлатформыКомпоненты = Строка(СистемнаяИнформация.ТипПлатформы);
				КомпонентаПечатиШК = ГенерацияШтрихкодаСерверПовтИсп.ПодключитьКомпонентуГенерацииИзображенияШтрихкода(ТипПлатформыКомпоненты);
				Если КомпонентаПечатиШК = Неопределено ИЛИ
					НЕ ЗначениеЗаполнено(ДанныеДляПечати.ШтрихКод) Тогда
					Область.Рисунки.Удалить(РисунокШтрихКод);
				Иначе
					РисунокШтрихКод.ВыводитьНаПечать = Истина;
					
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина);
					ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота);
					ПараметрыШтрихкода.Вставить("Штрихкод", ДанныеДляПечати.ШтрихКод);
					ПараметрыШтрихкода.Вставить("ТипКода", 1);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
					ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
					
					РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			ТабДокумент.Вывести(Область);
		КонецЕсли;
		
		Если ФлагПечати = 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если ФлагПечати <> 1 Тогда
			
			Область = Макет.ПолучитьОбласть("Оборотная");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			ТабДокумент.Вывести(Область);
			
		КонецЕсли;
		
		Если МаршрутныйЛист Тогда
			ПечатьМаршрутногоЛиста_Новый(ТабДокумент);
		КонецЕсли;
		
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ТабДокумент.ПолеСверху 	= 0;
		ТабДокумент.ПолеСлева 	= 0;
		ТабДокумент.ПолеСнизу 	= 0;
		ТабДокумент.ПолеСправа 	= 0;
		
		Возврат ТабДокумент;
	КонецЕсли;
	
	мМаксСтрок = 2;
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	рсТранспортноеСредство = уатПрочитатьРеквизитыТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
	мМодельТранспортноеСредство = рсТранспортноеСредство.Модель;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент.ПолеСверху 	= 0;
	ТабДокумент.ПолеСлева 	= 0;
	ТабДокумент.ПолеСнизу 	= 0;
	ТабДокумент.ПолеСправа 	= 0;
	
	Если ФлагПечати <> 2 Тогда
		Обл = Макет.ПолучитьОбласть("Лицевая");
		
		Попытка
			ШтрихКод = ПолучитьШтрихкод();
			
			РисунокШтрихКод = Обл.Рисунки.шк;
			Если КомпонентаПечатиШК = Неопределено ИЛИ
				НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
				Обл.Рисунки.Удалить(РисунокШтрихКод);
			Иначе
				РисунокШтрихКод.ВыводитьНаПечать = Истина;
				
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина);
				ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота);
				ПараметрыШтрихкода.Вставить("Штрихкод", ШтрихКод);
				ПараметрыШтрихкода.Вставить("ТипКода", 1);
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
				ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
				
				РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Обл.Параметры.ВидСообщения = ДанныеДляПечати.ВидСообщения;
		Обл.Параметры.ВидПеревозки = ДанныеДляПечати.ВидПеревозки;
		
		мНомерПЛ = СокрЛП(ОбъектПечати.ПутевойЛист.Номер);
		Обл.Параметры.Номер 		= мНомерПЛ;
		ФорматДаты 				= "ДФ='дд ММММ гггг'";
		Обл.Параметры.ДатаВыписки 		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, ФорматДаты);
		
		Обл.Параметры.ТекстДействителенДо = "Срок действия с: " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, ФорматДаты) + " по " + Формат(ОбъектПечати.ПутевойЛист.ДействителенДо, ФорматДаты);
		
		Обл.Параметры.ОрганизацияКр = СформироватьНаименованиеОрганизации(ОбъектПечати.ПутевойЛист.Организация);
		
		Обл.Параметры.КодПоОКПО = ОбъектПечати.ПутевойЛист.ОрганизацияКодПоОКПО;
		Обл.Параметры.МодельТС 		= уатОбщегоНазначения.уатПредставлениеМоделиТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
		Если ЗначениеЗаполнено(мМодельТранспортноеСредство) Тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.ТипТС;
		КонецЕсли;
		
		Если СокрЛП(ОбъектПечати.ПутевойЛист.ОрганизацияИНН) = "8911028380" И
			ЗначениеЗаполнено(мМодельТранспортноеСредство.НоменклатураУслуги) Тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.прНоменклатураУслуги;
		КонецЕсли;
		
		Обл.Параметры.ТранспортноеСредствоГосНомер	= рсТранспортноеСредство.ГосударственныйНомер;
		Обл.Параметры.ТранспортноеСредствоГарНомер	= рсТранспортноеСредство.ГаражныйНомер;
		
		Если рсТранспортноеСредство.Колонна <> Неопределено Тогда
			Обл.Параметры.Колонна		= рсТранспортноеСредство.Колонна.Код;
		КонецЕсли;	
		
		Водители 					= "" + ОбъектПечати.ПутевойЛист.Водитель1; 
		Если Не ЗначениеЗаполнено(ОбъектПечати.ПутевойЛист.Водитель2) Тогда
			Обл.Параметры.Водители = Водители;
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.Водители = Обл.Параметры.Водители + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1СтраховойНомерПФР);
			КонецЕсли;
		Иначе
			Обл.Параметры.Водители = СокрЛП(Водители) + ", " + ОбъектПечати.ПутевойЛист.Водитель2; 
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.Водители = СокрЛП(Водители) + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1СтраховойНомерПФР) + ", " + ОбъектПечати.ПутевойЛист.Водитель2 + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель2СтраховойНомерПФР1);
			КонецЕсли;
		КонецЕсли;	
		мРеквизитыВодителя1 		= уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ОбъектПечати.ПутевойЛист.Водитель1, ОбъектПечати.ПутевойЛист.ДатаВыписки);
		Обл.Параметры.ВодительКод 	= мРеквизитыВодителя1.ТабельныйНомер;
		
		Обл.Параметры.КлассВодителя = мРеквизитыВодителя1.Класс;
		
		ВидУдостоверения = Справочники.уатВидыДДД.ПустаяСсылка();		
		ДанныеУдостоверения = ПолучитьУдостоверениеСотрудника(ОбъектПечати.ПутевойЛист.ДатаВыписки, ОбъектПечати.ПутевойЛист.Водитель1, ВидУдостоверения);
		Если ДанныеУдостоверения = Неопределено Тогда	
			Обл.Параметры.НомерУдостоверенияВодителя = ?(СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия)="","",СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия) + " ") + ОбъектПечати.УдостоверенияВодителя1.Номер;
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.НомерУдостоверенияВодителя = Обл.Параметры.НомерУдостоверенияВодителя + " от " + Формат(ОбъектПечати.УдостоверенияВодителя1.ДатаВыдачи, "ДФ=dd.MM.yy");
			КонецЕсли;
		Иначе
			Обл.Параметры.НомерУдостоверенияВодителя = ?(ПустаяСтрока(ДанныеУдостоверения.Серия), "", СокрЛП(ДанныеУдостоверения.Серия) + " ") + ДанныеУдостоверения.Номер;
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.НомерУдостоверенияВодителя = Обл.Параметры.НомерУдостоверенияВодителя + " от " + Формат(ДанныеУдостоверения.ДатаВыдачи, "ДФ=dd.MM.yy");
			КонецЕсли;
		КонецЕсли;
		
		Обл.Параметры.ЛицензионнаяКарточка 		= рсТранспортноеСредство.ЛицензионнаяКарточка;
		Обл.Параметры.НомерЛицензионнойКарточки 	= рсТранспортноеСредство.НомерЛицензионнойКарточки;
		Обл.Параметры.СерияЛицензионнойКарточки 	= рсТранспортноеСредство.СерияЛицензионнойКарточки;
		Обл.Параметры.НомерСерииЛицензионнойКарточки = рсТранспортноеСредство.НомерСерииЛицензионнойКарточки;
		
		мТекИнд = 0;
		Для мИнд = 1 по ОбъектПечати.Прицепы.Количество() Цикл
			мПрицеп = ОбъектПечати.Прицепы[мИнд-1].ТС;
			рсПрицеп = уатПрочитатьРеквизитыТС(мПрицеп);
			Если уатОбщегоНазначения.уатЭтоТС(мПрицеп) Тогда
				мТекИнд = мТекИнд + 1;
				Если мТекИнд = 1 Тогда
					Обл.Параметры.ПрицепМодель1 = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
					Попытка
						Обл.Параметры.ПрицепГосНомер1 = рсПрицеп.ГосударственныйНомер;
						Обл.Параметры.ПрицепГарНомер1 = рсПрицеп.ГаражныйНомер;
					Исключение
					КонецПопытки;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Обл.Параметры.ВремяВыезда		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда,"ДФ=ЧЧ:мм");
		Обл.Параметры.ВремяВозвращения	= Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения,"ДФ=ЧЧ:мм");
		
		Если ОбъектПечати.ПутевойЛист.ВыдатьКоличествоГорючего > 0 Тогда
			Обл.Параметры.ВыдатьГорючее				= ОбъектПечати.ПутевойЛист.ВыдатьГорючее;
			Обл.Параметры.ВыдатьКоличествоГорючего = ОбъектПечати.ПутевойЛист.ВыдатьКоличествоГорючего;
		КонецЕсли;
	
		Обл.Параметры.СпидометрВыезда		= ОбъектПечати.ПутевойЛист.СпидометрВыезда;
		Попытка
			Обл.Параметры.СпидометрВозвращения	= ?(ОбъектПечати.ПутевойЛист.СпидометрВозвращения = 0, "", ОбъектПечати.ПутевойЛист.СпидометрВозвращения);
		Исключение
		КонецПопытки;

		Для Каждого ТекСтрока из ОбъектПечати.РасходГСМ Цикл
			рсТС = уатПрочитатьРеквизитыТС(ТекСтрока.ТС);
			Если ТекСтрока.ТС = ОбъектПечати.ПутевойЛист.ТранспортноеСредство Тогда
				Если ТекСтрока.ГСМ = рсТС.Модель.ОсновноеТопливо Тогда
					Обл.Параметры.ГСМ1	= ТекСтрока.ГСМ;
					Обл.Параметры.ОстатокПриВыезде1	= ТекСтрока.ОстатокПриВыезде;
					
					Попытка
						Обл.Параметры.ОстатокПриВозвращении1 = ?(ТекСтрока.ОстатокПриВозвращении = 0, "", ТекСтрока.ОстатокПриВозвращении);
					Исключение
					КонецПопытки;
				Иначе
					Обл.Параметры.ГСМ2	= ТекСтрока.ГСМ;
					Обл.Параметры.ОстатокПриВыезде2	= ТекСтрока.ОстатокПриВыезде;
					
					Попытка
						Обл.Параметры.ОстатокПриВозвращении2 = ?(ТекСтрока.ОстатокПриВозвращении = 0, "", ТекСтрока.ОстатокПриВозвращении);
					Исключение
					КонецПопытки;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		Обл.Параметры.ВыдалДиспетчер	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыдалДиспетчер);
		Обл.Параметры.ВыпустилМеханик	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыпустилМеханик);
		Обл.Параметры.ПринялМеханик		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ПринялМеханик);
		Обл.Параметры.ВодительСдал		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Водитель1);
		Обл.Параметры.ВодительПринял	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Водитель1);
		Обл.Параметры.ОсмотрелВрач = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ОсмотрелВрач);
		
		Для Каждого ТекСтрока Из ОбъектПечати.Задание Цикл
			ТекИндекс = ОбъектПечати.Задание.Индекс(ТекСтрока) + 1;
			
			Если ТекИндекс > мМаксСтрок Тогда
				Прервать;
			КонецЕсли;
			
			стрОбласть = "ВРаспоряжение" + Строка(ТекИндекс);
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Область(стрОбласть).Текст	= ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Область(стрОбласть).Текст	= ТекСтрока.Подразделение.Наименование;
			КонецЕсли;
			Обл.Область(стрОбласть).Текст	= Обл.Область(стрОбласть).Текст + ?(ПредставлениеАдреса(ТекСтрока.АдресПрибытия)="","",", " +ПредставлениеАдреса(ТекСтрока.АдресПрибытия));
			стрОбласть = "ВремяПрибытия" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяПрибытия, ?(ТекСтрока.ВремяПрибытия - НачалоДня(ТекСтрока.ВремяПрибытия) = 0, "ДФ=dd.MM.yyyy", "ДФ='dd.MM.yyyy ЧЧ:мм'"));
			стрОбласть = "ВремяУбытия" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяУбытия, ?(ТекСтрока.ВремяУбытия - НачалоДня(ТекСтрока.ВремяУбытия) = 0, "ДФ=dd.MM.yyyy", "ДФ='dd.MM.yyyy ЧЧ:мм'"));
		КонецЦикла;
		
		Если ОбъектПечати.Задание.Количество() > 0 Тогда
			ТекСтрока = ОбъектПечати.Задание[0];
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Параметры.Заказчик = ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Параметры.Заказчик = ТекСтрока.Подразделение.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбъектПечати.Задание.Количество() > 1 Тогда
			ТекСтрока = ОбъектПечати.Задание[1];
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Параметры.Заказчик2 = ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Параметры.Заказчик2 = ТекСтрока.Подразделение.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		ТабДокумент.Вывести(Обл);
	КонецЕсли;
	
	Если ФлагПечати = 0 Тогда	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если ФлагПечати <> 1 Тогда
		
		Обл = Макет.ПолучитьОбласть("Оборотная");
		
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	Если МаршрутныйЛист Тогда
		ПечатьМаршрутногоЛиста(ТабДокумент, Макет);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция уатПечать_4П(ИмяМакета, ФлагПечати="") Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист_ПутевойЛист";
	
	Если ЭтоИГСАвто Тогда
		Макет = ПолучитьМакет("_4П_новый");
		
		Если ФлагПечати <> 2 Тогда
			Область = Макет.ПолучитьОбласть("Лицевая");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			
			Попытка
				РисунокШтрихКод = Область.Рисунки.шк;
				СистемнаяИнформация = Новый СистемнаяИнформация;
				ТипПлатформыКомпоненты = Строка(СистемнаяИнформация.ТипПлатформы);
				КомпонентаПечатиШК = ГенерацияШтрихкодаСерверПовтИсп.ПодключитьКомпонентуГенерацииИзображенияШтрихкода(ТипПлатформыКомпоненты);
				Если КомпонентаПечатиШК = Неопределено ИЛИ
					НЕ ЗначениеЗаполнено(ДанныеДляПечати.ШтрихКод) Тогда
					Область.Рисунки.Удалить(РисунокШтрихКод);
				Иначе
					РисунокШтрихКод.ВыводитьНаПечать = Истина;
					
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина);
					ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота);
					ПараметрыШтрихкода.Вставить("Штрихкод", ДанныеДляПечати.ШтрихКод);
					ПараметрыШтрихкода.Вставить("ТипКода", 1);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
					ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
					
					РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			ТабДокумент.Вывести(Область);
		КонецЕсли;
		
		Если ФлагПечати = 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если ФлагПечати <> 1 Тогда
			
			Область = Макет.ПолучитьОбласть("Оборотная");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			ТабДокумент.Вывести(Область);
			
		КонецЕсли;
		
		Если МаршрутныйЛист Тогда
			ПечатьМаршрутногоЛиста_Новый(ТабДокумент);
		КонецЕсли;
		
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ТабДокумент.ПолеСверху 	= 0;
		ТабДокумент.ПолеСлева 	= 0;
		ТабДокумент.ПолеСнизу 	= 0;
		ТабДокумент.ПолеСправа 	= 0;
		
		Возврат ТабДокумент;
	КонецЕсли;
	
	мМаксСтрок = 2;
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	рсТранспортноеСредство = уатПрочитатьРеквизитыТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
	мМодельТранспортноеСредство = рсТранспортноеСредство.Модель;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент.ПолеСверху 	= 0;
	ТабДокумент.ПолеСлева 	= 0;
	ТабДокумент.ПолеСнизу 	= 0;
	ТабДокумент.ПолеСправа 	= 0;
	
	Если ФлагПечати <> 2 Тогда
		Обл = Макет.ПолучитьОбласть("Лицевая");
		
		Попытка
			ШтрихКод = ПолучитьШтрихкод();
			РисунокШтрихКод = Обл.Рисунки.шк;
			Если КомпонентаПечатиШК = Неопределено ИЛИ
				НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
				Обл.Рисунки.Удалить(РисунокШтрихКод);
			Иначе
				РисунокШтрихКод.ВыводитьНаПечать = Истина;
				
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина);
				ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота);
				ПараметрыШтрихкода.Вставить("Штрихкод", ШтрихКод);
				ПараметрыШтрихкода.Вставить("ТипКода", 1);
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
				ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
				
				РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
			КонецЕсли;
		Исключение
		КонецПопытки;
		Обл.Параметры.ВидСообщения = ДанныеДляПечати.ВидСообщения;
		Обл.Параметры.ВидПеревозки = ДанныеДляПечати.ВидПеревозки;
		
		мНомерПЛ = СокрЛП(ОбъектПечати.ПутевойЛист.Номер);
		ФорматДаты = "ДФ='дд ММММ гггг'";
		
		Обл.Параметры.Номер = мНомерПЛ;
		Обл.Параметры.ДатаВыписки = Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки,ФорматДаты);
		
		Обл.Параметры.ТекстДействителенДо = "Срок действия с: " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, ФорматДаты) + " по " + Формат(ОбъектПечати.ПутевойЛист.ДействителенДо, ФорматДаты);
		
		Обл.Параметры.ОрганизацияКр = СформироватьНаименованиеОрганизации(ОбъектПечати.ПутевойЛист.Организация);
		Обл.Параметры.КодПоОКПО = ОбъектПечати.ПутевойЛист.ОрганизацияКодПоОКПО;
		Обл.Параметры.МодельТС = уатОбщегоНазначения.уатПредставлениеМоделиТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
		Если ЗначениеЗаполнено(мМодельТранспортноеСредство) тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.ТипТС;
		КонецЕсли;
		
		Если СокрЛП(ОбъектПечати.ПутевойЛист.ОрганизацияИНН) = "8911028380" И
			ЗначениеЗаполнено(мМодельТранспортноеСредство.прНоменклатураУслуги) Тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.прНоменклатураУслуги;
		КонецЕсли;
		
		Обл.Параметры.ТранспортноеСредствоГосНомер = рсТранспортноеСредство.ГосударственныйНомер;
		Обл.Параметры.ТранспортноеСредствоГарНомер = рсТранспортноеСредство.ГаражныйНомер;
		Если рсТранспортноеСредство.Колонна <> Неопределено Тогда
			Обл.Параметры.Колонна = рсТранспортноеСредство.Колонна.Код;
		КонецЕсли;
		Обл.Параметры.НомерПЛВТалоне = мНомерПЛ;
		Обл.Параметры.ДатаПЛВТалоне = Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки,ФорматДаты);
		
		мРеквизитыВодителя1 = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ОбъектПечати.ПутевойЛист.Водитель1, ОбъектПечати.ПутевойЛист.ДатаВыписки);
		Если НЕ ОбъектПечати.ПутевойЛист.Водитель2.Пустая() Тогда
			мРеквизитыВодителя2 = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ОбъектПечати.ПутевойЛист.Водитель2, ОбъектПечати.ПутевойЛист.ДатаВыписки);
		КонецЕсли;
		
		Водители = "" + ОбъектПечати.ПутевойЛист.Водитель1; 
		
		Если Не ЗначениеЗаполнено(ОбъектПечати.ПутевойЛист.Водитель2) Тогда
			Обл.Параметры.Водители = Водители;
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.Водители = Обл.Параметры.Водители + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1СтраховойНомерПФР);
			КонецЕсли;
		Иначе
			Обл.Параметры.Водители = СокрЛП(Водители) + ", " + ОбъектПечати.ПутевойЛист.Водитель2; 
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.Водители = СокрЛП(Водители) + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1СтраховойНомерПФР) + ", " + ОбъектПечати.ПутевойЛист.Водитель2 + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель2СтраховойНомерПФР1);
			КонецЕсли;
			Обл.Параметры.Водитель2Код = мРеквизитыВодителя2.ТабельныйНомер;
		КонецЕсли;	
		
		Обл.Параметры.ВодительКод 	= мРеквизитыВодителя1.ТабельныйНомер;
		Обл.Параметры.КлассВодителя = мРеквизитыВодителя1.Класс;
		
		Обл.Параметры.НомерУдостоверенияВодителя = ?(СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия)="","",СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия) + " ") + ОбъектПечати.УдостоверенияВодителя1.Номер;
		Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
			Обл.Параметры.НомерУдостоверенияВодителя = Обл.Параметры.НомерУдостоверенияВодителя + " от " + Формат(ОбъектПечати.УдостоверенияВодителя1.ДатаВыдачи, "ДФ=dd.MM.yy");
		КонецЕсли;
		
		Обл.Параметры.ЛицензионнаяКарточка 		= рсТранспортноеСредство.ЛицензионнаяКарточка;
		Обл.Параметры.НомерЛицензионнойКарточки 	= рсТранспортноеСредство.НомерЛицензионнойКарточки;
		Обл.Параметры.СерияЛицензионнойКарточки 	= рсТранспортноеСредство.СерияЛицензионнойКарточки;
		Обл.Параметры.НомерСерииЛицензионнойКарточки = рсТранспортноеСредство.НомерСерииЛицензионнойКарточки;
		
		СопровождающиеЛица 					= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Сотрудник1);
		Если Не ЗначениеЗаполнено(ОбъектПечати.ПутевойЛист.Сотрудник2) Тогда
			Обл.Параметры.СопровождающиеЛица = СопровождающиеЛица;
		Иначе
			Обл.Параметры.СопровождающиеЛица = СокрЛП(СопровождающиеЛица) + ", " +уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Сотрудник2);
		КонецЕсли;	
		
		мТекИнд = 0;
		Для мИнд = 1 по ОбъектПечати.Прицепы.Количество() Цикл
			мПрицеп = ОбъектПечати.Прицепы[мИнд-1].ТС;
			рсПрицеп = уатПрочитатьРеквизитыТС(мПрицеп);
			Если уатОбщегоНазначения.уатЭтоТС(мПрицеп) Тогда
				мТекИнд = мТекИнд + 1;
				Если мТекИнд = 1 Тогда
					Обл.Параметры.ПрицепМодель1 = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
					Попытка
						Обл.Параметры.ПрицепГосНомер1 = рсПрицеп.ГосударственныйНомер;
						Обл.Параметры.ПрицепГарНомер1 = рсПрицеп.ГаражныйНомер;
					Исключение
					КонецПопытки;	
				ИначеЕсли мТекИнд = 2 Тогда
					Обл.Параметры.ПрицепМодель2 = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
					Попытка
						Обл.Параметры.ПрицепГосНомер2 = рсПрицеп.ГосударственныйНомер;
						Обл.Параметры.ПрицепГарНомер2 = рсПрицеп.ГаражныйНомер;
					Исключение
					КонецПопытки;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Обл.Параметры.ДатаВыезда_ДД		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда,"ДФ=дд");
		Обл.Параметры.ДатаВыезда_ММММ	= Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда,"ДФ=ММ");
		Обл.Параметры.ВремяВыезда_ЧЧ		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда,"ДФ=ЧЧ");
		Обл.Параметры.ВремяВыезда_ММ		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда,"ДФ=мм");
		
		Обл.Параметры.ДатаВозвращения_ДД		= Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения,"ДФ=дд");
		Обл.Параметры.ДатаВозвращения_ММММ		= Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения,"ДФ=ММ");
		Обл.Параметры.ВремяВозвращения_ЧЧ		= Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения,"ДФ=ЧЧ");
		Обл.Параметры.ВремяВозвращения_ММ		= Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения,"ДФ=мм");
		
		Если ОбъектПечати.ПутевойЛист.ВыдатьКоличествоГорючего > 0 Тогда
			Обл.Параметры.ВыдатьГорючее				= ОбъектПечати.ПутевойЛист.ВыдатьГорючее;
			Обл.Параметры.ВыдатьКоличествоГорючего = ОбъектПечати.ПутевойЛист.ВыдатьКоличествоГорючего;
		КонецЕсли;
		
		Обл.Параметры.СпидометрВыезда		= ОбъектПечати.ПутевойЛист.СпидометрВыезда;
		Попытка
			Обл.Параметры.СпидометрВозвращения	= ?(ОбъектПечати.ПутевойЛист.СпидометрВозвращения = 0, "", ОбъектПечати.ПутевойЛист.СпидометрВозвращения);
		Исключение
		КонецПопытки;
		
		Для Каждого ТекСтрока из ОбъектПечати.РасходГСМ Цикл
			рсТС = уатПрочитатьРеквизитыТС(ТекСтрока.ТС);
			Если ТекСтрока.ТС = ОбъектПечати.ПутевойЛист.ТранспортноеСредство Тогда
				Если ТекСтрока.ГСМ = рсТС.Модель.ОсновноеТопливо Тогда
					Обл.Параметры.ГСМ1	= ТекСтрока.ГСМ;
					Обл.Параметры.ОстатокПриВыезде1	= ТекСтрока.ОстатокПриВыезде;
					Попытка
						Обл.Параметры.ОстатокПриВозвращении1 = ?(ТекСтрока.ОстатокПриВозвращении = 0, "", ТекСтрока.ОстатокПриВозвращении);
					Исключение
					КонецПопытки;
				Иначе
					Обл.Параметры.ГСМ2	= ТекСтрока.ГСМ;
					Обл.Параметры.ОстатокПриВыезде2	= ТекСтрока.ОстатокПриВыезде;
					Попытка
						Обл.Параметры.ОстатокПриВозвращении2 = ?(ТекСтрока.ОстатокПриВозвращении = 0, "", ТекСтрока.ОстатокПриВозвращении);
					Исключение
					КонецПопытки;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		Обл.Параметры.ВыдалДиспетчер	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыдалДиспетчер);
		Обл.Параметры.ВыпустилМеханик	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыпустилМеханик);
		Обл.Параметры.ПринялМеханик		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ПринялМеханик);
		Обл.Параметры.ВодительСдал		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Водитель1);
		Обл.Параметры.ВодительПринял	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Водитель1);
		Обл.Параметры.ОсмотрелВрач = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ОсмотрелВрач);
		
		Для Каждого ТекСтрока Из ОбъектПечати.Задание Цикл
			ТекИндекс = ОбъектПечати.Задание.Индекс(ТекСтрока) + 1;
			
			Если ТекИндекс > мМаксСтрок Тогда
				Прервать;
			КонецЕсли;
			
			стрОбласть = "ВРаспоряжение" + Строка(ТекИндекс);
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Область(стрОбласть).Текст	= ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Область(стрОбласть).Текст	= ТекСтрока.Подразделение.Наименование;
			КонецЕсли;
			Обл.Область(стрОбласть).Текст	= Обл.Область(стрОбласть).Текст + ", " + ПредставлениеАдреса(ТекСтрока.АдресПрибытия);
			стрОбласть = "ВремяПрибытия" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяПрибытия, ?(ТекСтрока.ВремяПрибытия - НачалоДня(ТекСтрока.ВремяПрибытия) = 0, "ДФ=dd.MM.yyyy", "ДФ='dd.MM.yyyy ЧЧ:мм'"));
			стрОбласть = "ВремяУбытия" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяУбытия, ?(ТекСтрока.ВремяУбытия - НачалоДня(ТекСтрока.ВремяУбытия) = 0, "ДФ=dd.MM.yyyy", "ДФ='dd.MM.yyyy ЧЧ:мм'"));
			
			стрОбласть = "КоличествоЕздок" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоЕздок = 0, "",ТекСтрока.КоличествоЕздок);
			стрОбласть = "КоличествоЧасов" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоЧасов = 0, "",ТекСтрока.КоличествоЧасов);
			
		КонецЦикла;
		
		ТабДокумент.Вывести(Обл);
	КонецЕсли;
	
	Если ФлагПечати = 0 Тогда	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если ФлагПечати <> 1 Тогда
		
		Обл = Макет.ПолучитьОбласть("Оборотная");
		
		Обл.Параметры.Организация 		= ОбъектПечати.ПутевойЛист.Организация;
		Обл.Параметры.МодельТС 		= уатОбщегоНазначения.уатПредставлениеМоделиТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
		Обл.Параметры.ТранспортноеСредствоГосНомер	= рсТранспортноеСредство.ГосударственныйНомер;
		
		Если ОбъектПечати.Задание.Количество() > 0 Тогда
			ТекСтрока = ОбъектПечати.Задание[0];
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Параметры.Заказчик = ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Параметры.Заказчик = ТекСтрока.Подразделение.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		мТекИнд = 0;
		Для мИнд = 1 по ОбъектПечати.Прицепы.Количество() Цикл
			мПрицеп = ОбъектПечати.Прицепы[мИнд-1].ТС;
			рсПрицеп = уатПрочитатьРеквизитыТС(мПрицеп);
			Если уатОбщегоНазначения.уатЭтоТС(мПрицеп) Тогда
				мТекИнд = мТекИнд + 1;
				Если мТекИнд = 1 Тогда
					Обл.Параметры.ПрицепМодель1 = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
					Попытка
						Обл.Параметры.ПрицепГосНомер1 = рсПрицеп.ГосударственныйНомер;
					Исключение
					КонецПопытки;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		мНомерПЛ = СокрЛП(ОбъектПечати.ПутевойЛист.Номер);
		ФорматДаты = "ДФ='дд ММММ гггг'";
		
		Обл.Параметры.НомерПЛВТалоне = мНомерПЛ;
		Обл.Параметры.ДатаПЛВТалоне = Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки,ФорматДаты);
		
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	Если ПечатьЧекЛиста Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Область = Макет.ПолучитьОбласть("ЧекЛист");
		Область.Параметры.Номер					= мНомерПЛ;
		Область.Параметры.ДатаВыписки			= Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, ФорматДаты);
		Область.Параметры.ГосударственныйНомер	= рсТранспортноеСредство.ГосударственныйНомер;
		Область.Параметры.Водитель				= СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1);
		ТабДокумент.Вывести(Область);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если МаршрутныйЛист Тогда
		ПечатьМаршрутногоЛиста(ТабДокумент, Макет);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция уатПечать_6С(ИмяМакета, ФлагПечати="") Экспорт	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист_ПутевойЛист";
	
	Если ЭтоИГСАвто Тогда
		Макет = ПолучитьМакет("_6С_новый");
		
		Если ФлагПечати <> 2 Тогда
			Область = Макет.ПолучитьОбласть("Лицевая");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			
			Попытка
				РисунокШтрихКод = Область.Рисунки.шк;
				СистемнаяИнформация = Новый СистемнаяИнформация;
				ТипПлатформыКомпоненты = Строка(СистемнаяИнформация.ТипПлатформы);
				КомпонентаПечатиШК = ГенерацияШтрихкодаСерверПовтИсп.ПодключитьКомпонентуГенерацииИзображенияШтрихкода(ТипПлатформыКомпоненты);
				Если КомпонентаПечатиШК = Неопределено ИЛИ
					НЕ ЗначениеЗаполнено(ДанныеДляПечати.ШтрихКод) Тогда
					Область.Рисунки.Удалить(РисунокШтрихКод);
				Иначе
					РисунокШтрихКод.ВыводитьНаПечать = Истина;
					
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина);
					ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота);
					ПараметрыШтрихкода.Вставить("Штрихкод", ДанныеДляПечати.ШтрихКод);
					ПараметрыШтрихкода.Вставить("ТипКода", 1);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
					ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
					
					РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			ТабДокумент.Вывести(Область);
		КонецЕсли;
		
		Если ФлагПечати = 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если ФлагПечати <> 1 Тогда
			
			Область = Макет.ПолучитьОбласть("Оборотная");
			Область.Параметры.Заполнить(ДанныеДляПечати);
			ТабДокумент.Вывести(Область);
			
		КонецЕсли;
		
		Если МаршрутныйЛист Тогда
			ПечатьМаршрутногоЛиста_Новый(ТабДокумент);
		КонецЕсли;
		
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ТабДокумент.ПолеСверху 	= 0;
		ТабДокумент.ПолеСлева 	= 0;
		ТабДокумент.ПолеСнизу 	= 0;
		ТабДокумент.ПолеСправа 	= 0;
		
		Возврат ТабДокумент;
	КонецЕсли;
	
	мМаксСтрок = 2;
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	рсТранспортноеСредство = уатПрочитатьРеквизитыТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
	мМодельТранспортноеСредство = рсТранспортноеСредство.Модель;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент.ПолеСверху 	= 0;
	ТабДокумент.ПолеСлева 	= 0;
	ТабДокумент.ПолеСнизу 	= 0;
	ТабДокумент.ПолеСправа 	= 0;
	
	Если ФлагПечати <> 2 Тогда
		Обл = Макет.ПолучитьОбласть("Лицевая");
		
		Попытка
			ШтрихКод = ПолучитьШтрихкод();
			РисунокШтрихКод = Обл.Рисунки.шк;
			Если КомпонентаПечатиШК = Неопределено ИЛИ
				НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
				Обл.Рисунки.Удалить(РисунокШтрихКод);
			Иначе
				РисунокШтрихКод.ВыводитьНаПечать = Истина;
				
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина", РисунокШтрихКод.Ширина);
				ПараметрыШтрихкода.Вставить("Высота", РисунокШтрихКод.Высота);
				ПараметрыШтрихкода.Вставить("Штрихкод", ШтрихКод);
				ПараметрыШтрихкода.Вставить("ТипКода", 1);
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
				ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
				
				РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(КомпонентаПечатиШК, ПараметрыШтрихкода);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Обл.Параметры.ВидСообщения = ДанныеДляПечати.ВидСообщения;
		Обл.Параметры.ВидПеревозки = ДанныеДляПечати.ВидПеревозки;
		
		мНомерПЛ = СокрЛП(ОбъектПечати.ПутевойЛист.Номер);
		ФорматДаты = "ДФ='дд ММММ гггг'";
		Обл.Параметры.Номер 		= мНомерПЛ;
		Обл.Параметры.ДатаВыписки 		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки,ФорматДаты);
		
		Обл.Параметры.ТекстДействителенДо = "Срок действия с: " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда, ФорматДаты) + " по " + Формат(ОбъектПечати.ПутевойЛист.ДействителенДо, ФорматДаты);
		
		Обл.Параметры.Организация = ОбъектПечати.ПутевойЛист.ОрганизацияНаименование + ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ОбъектПечати.ПутевойЛист.Организация, ОбъектПечати.ПутевойЛист.ДатаВыписки), "Наименование,ЮридическийАдрес,Телефоны");
		Обл.Параметры.ОрганизацияКр = СформироватьНаименованиеОрганизации(ОбъектПечати.ПутевойЛист.Организация);
		Обл.Параметры.КодПоОКПО = ОбъектПечати.ПутевойЛист.ОрганизацияКодПоОКПО;
		Обл.Параметры.МодельТС = уатОбщегоНазначения.уатПредставлениеМоделиТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
		Если ЗначениеЗаполнено(мМодельТранспортноеСредство) тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.ТипТС;
		КонецЕсли;
		
		Если СокрЛП(ОбъектПечати.ПутевойЛист.ОрганизацияИНН) = "8911028380" И
			ЗначениеЗаполнено(мМодельТранспортноеСредство.прНоменклатураУслуги) Тогда
			Обл.Параметры.ТипТС = мМодельТранспортноеСредство.прНоменклатураУслуги;
		КонецЕсли;
		
		Обл.Параметры.ТранспортноеСредствоГосНомер	= рсТранспортноеСредство.ГосударственныйНомер;
		Обл.Параметры.ТранспортноеСредствоГарНомер	= рсТранспортноеСредство.ГаражныйНомер;
		Если рсТранспортноеСредство.Колонна <> Неопределено Тогда
			Обл.Параметры.Колонна						= рсТранспортноеСредство.Колонна.Код;
		КонецЕсли;	
		Если ОбъектПечати.ПутевойЛист.ВидПЛ = Перечисления.уатВидыПЛ._4П Тогда
			Обл.Параметры.НомерПЛВТалоне 		= мНомерПЛ;
			Обл.Параметры.ДатаПЛВТалоне	 		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки,ФорматДаты);
		КонецЕсли;	
		
		Водители 					= "" + ОбъектПечати.ПутевойЛист.Водитель1; 
		Если Не ЗначениеЗаполнено(ОбъектПечати.ПутевойЛист.Водитель2) Тогда
			Обл.Параметры.Водители = Водители;
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.Водители = Обл.Параметры.Водители + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1СтраховойНомерПФР);
			КонецЕсли;
		Иначе
			Обл.Параметры.Водители = СокрЛП(Водители) + ", " + ОбъектПечати.ПутевойЛист.Водитель2; 
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.Водители = СокрЛП(Водители) + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1.СтраховойНомерПФР) + ", " + ОбъектПечати.ПутевойЛист.Водитель2 + ", СНИЛС " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель2СтраховойНомерПФР1);
			КонецЕсли;
		КонецЕсли;	
		мРеквизитыВодителя1 		= уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ОбъектПечати.ПутевойЛист.Водитель1, ОбъектПечати.ПутевойЛист.ДатаВыписки);
		Обл.Параметры.ВодительКод 	= мРеквизитыВодителя1.ТабельныйНомер;
		
		Обл.Параметры.КлассВодителя = мРеквизитыВодителя1.Класс;	
		Обл.Параметры.НомерУдостоверенияВодителя = ?(СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия)="","",СокрЛП(ОбъектПечати.УдостоверенияВодителя1.Серия) + " ") + ОбъектПечати.УдостоверенияВодителя1.Номер;
		Если ОбъектПечати.ПутевойЛист.Дата >= '20230901' Тогда
			Обл.Параметры.НомерУдостоверенияВодителя = Обл.Параметры.НомерУдостоверенияВодителя + " от " + Формат(ОбъектПечати.УдостоверенияВодителя1.ДатаВыдачи, "ДФ=dd.MM.yy");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектПечати.ПутевойЛист.Водитель2) Тогда	
			Обл.Параметры.НомерУдостоверенияВодителя = СокрЛП(Обл.Параметры.НомерУдостоверенияВодителя) + ", "
			+ ?(СокрЛП(ОбъектПечати.УдостоверенияВодителя2.Серия)="","",СокрЛП(ОбъектПечати.УдостоверенияВодителя2.Серия) + " ") + ОбъектПечати.УдостоверенияВодителя2.Номер;
			Если ОбъектПечати.ПутевойЛист.ДатаВыписки >= '20230901' Тогда
				Обл.Параметры.НомерУдостоверенияВодителя = Обл.Параметры.НомерУдостоверенияВодителя + " от " + Формат(ОбъектПечати.УдостоверенияВодителя2.ДатаВыдачи, "ДФ=dd.MM.yy");
			КонецЕсли;
		КонецЕсли;
		
		Обл.Параметры.ЛицензионнаяКарточка 		= рсТранспортноеСредство.ЛицензионнаяКарточка;
		Обл.Параметры.НомерЛицензионнойКарточки 	= рсТранспортноеСредство.НомерЛицензионнойКарточки;
		Обл.Параметры.СерияЛицензионнойКарточки 	= рсТранспортноеСредство.СерияЛицензионнойКарточки;
		Обл.Параметры.НомерСерииЛицензионнойКарточки = рсТранспортноеСредство.НомерСерииЛицензионнойКарточки;
		
		Обл.Параметры.ВремяВыезда		= Формат(ОбъектПечати.ПутевойЛист.ДатаВыезда,"ДФ=ЧЧ:мм");
		Обл.Параметры.ВремяВозвращения	= Формат(ОбъектПечати.ПутевойЛист.ДатаВозвращения,"ДФ=ЧЧ:мм");
		
		Если ОбъектПечати.ПутевойЛист.ВыдатьКоличествоГорючего > 0 Тогда
			Обл.Параметры.ВыдатьГорючее				= ОбъектПечати.ПутевойЛист.ВыдатьГорючее;
			Обл.Параметры.ВыдатьКоличествоГорючего = ОбъектПечати.ПутевойЛист.ВыдатьКоличествоГорючего;
		КонецЕсли;
		
		Обл.Параметры.СпидометрВыезда		= ОбъектПечати.ПутевойЛист.СпидометрВыезда;
		Обл.Параметры.СпидометрВозвращения	= ОбъектПечати.ПутевойЛист.СпидометрВозвращения;
		
		Обл.Параметры.НулевойПробегВыезда	= ОбъектПечати.ПутевойЛист.НулевойПробегВыезда;
		Обл.Параметры.НулевойПробегВозвращения = ОбъектПечати.ПутевойЛист.НулевойПробегВозвращения;
		
		Для Каждого ТекСтрока из ОбъектПечати.РасходГСМ Цикл
			рсТС = уатПрочитатьРеквизитыТС(ТекСтрока.ТС);
			Если ТекСтрока.ТС = ОбъектПечати.ПутевойЛист.ТранспортноеСредство Тогда
				Если ТекСтрока.ГСМ = рсТС.Модель.ОсновноеТопливо Тогда
					Обл.Параметры.ГСМ1	= ТекСтрока.ГСМ;
					Обл.Параметры.ОстатокПриВыезде1	= ТекСтрока.ОстатокПриВыезде;
					Попытка
						Обл.Параметры.ОстатокПриВозвращении1 = ?(ТекСтрока.ОстатокПриВозвращении = 0, "", ТекСтрока.ОстатокПриВозвращении);
					Исключение
					КонецПопытки;
				Иначе
					Обл.Параметры.ГСМ2	= ТекСтрока.ГСМ;
					Обл.Параметры.ОстатокПриВыезде2	= ТекСтрока.ОстатокПриВыезде;
					Попытка
						Обл.Параметры.ОстатокПриВозвращении2 = ?(ТекСтрока.ОстатокПриВозвращении = 0, "", ТекСтрока.ОстатокПриВозвращении);
					Исключение
					КонецПопытки;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		Обл.Параметры.ВыдалДиспетчер	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыдалДиспетчер);
		Обл.Параметры.ВыпустилМеханик	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ВыпустилМеханик);
		Обл.Параметры.ПринялМеханик		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ПринялМеханик);
		Обл.Параметры.ВодительСдал		= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Водитель1);
		Обл.Параметры.ВодительПринял	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.Водитель1);
		Обл.Параметры.ОсмотрелВрач = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОбъектПечати.ПутевойЛист.ОсмотрелВрач);
		
		Обл.Параметры.СтрПутевойЛист = "№" + ОбъектПечати.ПутевойЛист.Номер + " от " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, "ДЛФ=D");
		
		Для Каждого ТекСтрока Из ОбъектПечати.Задание Цикл
			ТекИндекс = ОбъектПечати.Задание.Индекс(ТекСтрока) + 1;
			
			Если ТекИндекс > мМаксСтрок Тогда
				Прервать;
			КонецЕсли;
			
			стрОбласть = "ВРаспоряжение" + Строка(ТекИндекс);
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Область(стрОбласть).Текст	= ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Область(стрОбласть).Текст	= ТекСтрока.Подразделение.Наименование;
			КонецЕсли;	
			Обл.Область(стрОбласть).Текст	= Обл.Область(стрОбласть).Текст + ", " + ПредставлениеАдреса(ТекСтрока.АдресПрибытия);
			
			стрОбласть = "ВремяПрибытия" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.ВремяПрибытия - НачалоДня(ТекСтрока.ВремяПрибытия) = 0, "", Формат(ТекСтрока.ВремяПрибытия, "ДФ=ЧЧ:мм"));
			стрОбласть = "ВремяУбытия" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.ВремяУбытия - НачалоДня(ТекСтрока.ВремяУбытия) = 0, "", Формат(ТекСтрока.ВремяУбытия, "ДФ=ЧЧ:мм"));
			стрОбласть = "КоличествоЕздок" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоЕздок = 0, "",ТекСтрока.КоличествоЕздок);
			стрОбласть = "КоличествоЧасов" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоЧасов = 0, "",ТекСтрока.КоличествоЧасов);
			
		КонецЦикла;
		
		Если ОбъектПечати.Задание.Количество() > 0 Тогда
			ТекСтрока = ОбъектПечати.Задание[0];
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Параметры.Заказчик = ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Параметры.Заказчик = ТекСтрока.Подразделение.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		ТабДокумент.Вывести(Обл);
	КонецЕсли;
	
	Если ФлагПечати = 0 Тогда	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если ФлагПечати <> 1 Тогда
		
		Обл = Макет.ПолучитьОбласть("Оборотная");
		
		Обл.Параметры.Организация 		= ОбъектПечати.ПутевойЛист.ОрганизацияНаименование + ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ОбъектПечати.ПутевойЛист.Организация, ОбъектПечати.ПутевойЛист.ДатаВыписки), "Наименование,ЮридическийАдрес,Телефоны");
		Обл.Параметры.МодельТС 		= уатОбщегоНазначения.уатПредставлениеМоделиТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
		Обл.Параметры.ТранспортноеСредствоГосНомер	= рсТранспортноеСредство.ГосударственныйНомер;
		
		Обл.Параметры.СтрПутевойЛист = "№" + ОбъектПечати.ПутевойЛист.Номер + " от " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, "ДЛФ=D");
		
		Если ОбъектПечати.Задание.Количество() > 0 Тогда
			ТекСтрока = ОбъектПечати.ПутевойЛист.Задание[0];
			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
				Обл.Параметры.Заказчик = ?(НаименованиеКонтрагентаСокращенное, СокрЛП(ТекСтрока.Контрагент.Наименование), СокрЛП(ТекСтрока.Контрагент.НаименованиеПолное));
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
				Обл.Параметры.Заказчик = ТекСтрока.Подразделение.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	Если МаршрутныйЛист Тогда
		ПечатьМаршрутногоЛиста(ТабДокумент, Макет);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции 

Процедура ПечатьМаршрутногоЛиста(ТабличныйДокумент, Макет)
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ФорматДаты = "ДФ='дд ММММ гггг'";
	рсТранспортноеСредство = уатПрочитатьРеквизитыТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
	
	Область = Макет.ПолучитьОбласть("МаршрутныйЛистШапка");
	Область.Параметры.Номер = СокрЛП(ОбъектПечати.ПутевойЛист.Номер);
	Область.Параметры.Дата = Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, ФорматДаты);
	Область.Параметры.ДополнительныеДанные = "Ф.И.О. водителя " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1) + ", модель " + СокрЛП(рсТранспортноеСредство.Модель) + ", гос. № " + СокрЛП(рсТранспортноеСредство.ГосударственныйНомер) + ", № путевого листа " + СокрЛП(ОбъектПечати.ПутевойЛист.Номер) + ", дата выдачи " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, ФорматДаты) + " г.";
	ТабличныйДокумент.Вывести(Область);
	
	Н = 0;
	Для каждого СтрокаЗадание Из ОбъектПечати.Задание Цикл
		КоличествоДней = (НачалоДня(СтрокаЗадание.ВремяУбытия) - НачалоДня(СтрокаЗадание.ВремяПрибытия))/86400 + 1;
		
		Если Час(СтрокаЗадание.ВремяПрибытия)*60 + Минута(СтрокаЗадание.ВремяПрибытия) > Час(СтрокаЗадание.ВремяУбытия)*60 + Минута(СтрокаЗадание.ВремяУбытия) Тогда // переходящее задание
			КоличествоДней = КоличествоДней - 1;
		КонецЕсли;
		
		Для День = 1 По КоличествоДней Цикл
			Н = Н + 1;
			Область = Макет.ПолучитьОбласть("МаршрутныйЛистСтрока");
			Область.Параметры.Н = Н;
			
			Если День = 1 Тогда
				Область.Параметры.АдресПрибытия = СтрокаЗадание.АдресПрибытия;
				Область.Параметры.АдресУбытия = СтрокаЗадание.АдресУбытия;
			КонецЕсли;
			Область.Параметры.ДатаПрибытия = СтрокаЗадание.ВремяПрибытия + (День-1)*86400;
			Область.Параметры.ДатаУбытия = СтрокаЗадание.ВремяУбытия - (КоличествоДней - День)*86400;
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
	КонецЦикла;
	
	Для с = 1 по 20-Н Цикл
		Н = Н + 1;
		Область = Макет.ПолучитьОбласть("МаршрутныйЛистСтрока");
		Область.Параметры.Н = Н;
		ТабличныйДокумент.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("МаршрутныйЛистПодвал");
	Область.Параметры.Водитель = СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1);
	ТабличныйДокумент.Вывести(Область);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Процедура ПечатьМаршрутногоЛиста_Новый(ТабличныйДокумент)
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Макет = ПолучитьМакет("_МаршрутныйЛист");
	
	рсТранспортноеСредство = уатПрочитатьРеквизитыТС(ОбъектПечати.ПутевойЛист.ТранспортноеСредство);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заголовок = "Маршрутный лист к путевому листу №" + СокрЛП(ОбъектПечати.ПутевойЛист.Номер) + " от " + Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, "ДФ='дд ММММ гггг'");
	Область.Параметры.ДополнительныеДанные = "Ф.И.О. водителя " + СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1) + ", модель " + СокрЛП(рсТранспортноеСредство.Модель) + ", гос. № " + СокрЛП(рсТранспортноеСредство.ГосударственныйНомер);
	ТабличныйДокумент.Вывести(Область);
	
	Н = 0;
	Если ОбъектПечати.Задание.Количество() > 0 Тогда
		СтрокаЗадание = ОбъектПечати.Задание;
		
		ТекДата = НачалоДня(СтрокаЗадание.ВремяПрибытия);
		Пока ТекДата <= НачалоДня(СтрокаЗадание.ВремяУбытия) Цикл
			Если Н = 10 Тогда
				Прервать;
			КонецЕсли;
			
			Н = Н + 1;
			
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Н = Н;
			Область.Параметры.Дата = ТекДата;
			ТабличныйДокумент.Вывести(Область);
			
			ТекДата = ТекДата + 86400;
		КонецЦикла;
		
	КонецЕсли;
	
	Для с = 1 по 10-Н Цикл
		Н = Н + 1;
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Н = Н;
		ТабличныйДокумент.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.Водитель = СокрЛП(ОбъектПечати.ПутевойЛист.Водитель1);
	ТабличныйДокумент.Вывести(Область);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Функция ПолучитьШтрихкод() Экспорт
	НомерДокумента = СокрЛП(ОбъектПечати.ПутевойЛист.Номер);
	
	Попытка
		КодОрганизации = Число(Прав(СокрЛП(ОбъектПечати.ПутевойЛист.Организация.Код), 1));
	Исключение
		КодОрганизации = "0";
	КонецПопытки;
	
	ОстатокНомера = НомерДокумента;
	Поз = Найти(НомерДокумента, СокрЛП(ОбъектПечати.ПутевойЛист.Организация.Префикс));
	Если Поз > 0 Тогда
		ОстатокНомера = Сред(НомерДокумента, Поз + СтрДлина(СокрЛП(ОбъектПечати.ПутевойЛист.Организация.Префикс)));
	КонецЕсли;
	
	ИндексНачалаЧисловойЧасти = СтрДлина(ОстатокНомера) + 1;
	ТекИндекс = СтрДлина(ОстатокНомера);
	ЗначениеСимвола = Сред(ОстатокНомера, ТекИндекс, 1);
	Пока ЗначениеСимвола >= "0" И
		ЗначениеСимвола <= "9" Цикл
		Если ТекИндекс = 1 Тогда
			ИндексНачалаЧисловойЧасти = ТекИндекс;
			Прервать;
		КонецЕсли;
		
		ИндексНачалаЧисловойЧасти = ТекИндекс;
		ТекИндекс = ТекИндекс - 1;
		ЗначениеСимвола = Сред(ОстатокНомера, ТекИндекс, 1);
	КонецЦикла;
	
	СтрокаДопПрефикса = ?(ИндексНачалаЧисловойЧасти = 1, "", Лев(ОстатокНомера, ИндексНачалаЧисловойЧасти - 1));
	СтрокаЧисловойЧасти = Сред(ОстатокНомера, ИндексНачалаЧисловойЧасти);
	Пока СтрДлина(СтрокаЧисловойЧасти) > 1 И
		Лев(СтрокаЧисловойЧасти, 1) = "0" Цикл
		СтрокаЧисловойЧасти = Сред(СтрокаЧисловойЧасти, 2);
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаДопПрефикса) Тогда
		КодДопПрефикса = "00";
	ИначеЕсли СтрДлина(СтрокаДопПрефикса) > 1 Тогда
		КодДопПрефикса = "99";
	Иначе
		КодДопПрефикса = Формат(КодСимвола(Врег(СтрокаДопПрефикса)) - 1000, "ЧЦ=2; ЧВН=");
	КонецЕсли;
	
	Результат = Формат(ОбъектПечати.ПутевойЛист.ДатаВыписки, "ДФ=yy") + КодОрганизации + КодДопПрефикса;
	Пока СтрДлина(Результат) + СтрДлина(СтрокаЧисловойЧасти) < 12 Цикл
		СтрокаЧисловойЧасти = "0" + СтрокаЧисловойЧасти;
	КонецЦикла;
	
	Возврат Результат + СтрокаЧисловойЧасти;
КонецФункции

Функция ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода) Экспорт
	Эталон = ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ВнешняяКомпонента.Ширина = Окр(ПараметрыШтрихкода.Ширина/КоличествоМиллиметровВПикселе);
	ВнешняяКомпонента.Высота = Окр(ПараметрыШтрихкода.Высота/КоличествоМиллиметровВПикселе);
	
	ВнешняяКомпонента.АвтоТип = Ложь;
	ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	Попытка
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	Исключение
		
	КонецПопытки;
	
	ВнешняяКомпонента.СодержитКС = СтрДлина(ПараметрыШтрихкода.Штрихкод) = 13;
	
	ВнешняяКомпонента.ЗначениеКода = ПараметрыШтрихкода.Штрихкод;
	
	Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
		ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода + 10;
	КонецЕсли;
	
	ДвоичныеДанныеКартинки = ВнешняяКомпонента.ПолучитьШтрихкод();
	
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт
	
	Если ПустаяСтрока(Список) Тогда
		
		Список = "ИНН,Свидетельство,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
		Если Не СписокСведений.Свойство("НаименованиеДляПечатныхФорм") Тогда
			Список = "НаименованиеПолное," + Список;
		Иначе
			Список = "НаименованиеДляПечатныхФорм," + Список;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = "";
	
	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование",			" ");
	СоответствиеПараметров.Вставить("СокращенноеНаименование",		" ");
	СоответствиеПараметров.Вставить("НаименованиеДляПечатныхФорм",	" ");
	СоответствиеПараметров.Вставить("ИНН",							" ИНН ");
	СоответствиеПараметров.Вставить("КПП",							" КПП ");
	СоответствиеПараметров.Вставить("Свидетельство",				" ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",		" от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",				" ");
	СоответствиеПараметров.Вставить("Телефоны",						" тел.: ");
	СоответствиеПараметров.Вставить("НомерСчета",					" р/с ");
	СоответствиеПараметров.Вставить("Банк", 			" в банке ");
	СоответствиеПараметров.Вставить("БИК", 			" БИК ");
	СоответствиеПараметров.Вставить("КоррСчет", 			" к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО", 			" Код по ОКПО ");
	
	Список = Список + ?(Прав(Список, 1) = ",", "", ",");
	ЧислоПараметров = СтрЧислоВхождений(Список, ",");
	
	Для Счетчик = 1 по ЧислоПараметров Цикл
		
		ПозЗапятой = Найти(Список, ",");
		
		Если ПозЗапятой > 0 Тогда
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));
			
			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);
				
				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;
				
				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат) Тогда
					Результат = Результат + ",";
				КонецЕсли; 
				
				Результат = Результат + ?(СПрефиксом = Истина, ?(ПустаяСтрока(Результат), СокрЛ(Префикс), Префикс), "") + СтрокаДополнения;
				
			Исключение
				
				ОбщегоНазначения.СообщитьПользователю("Не удалось определить значение параметра организации: " + ИмяПараметра, СтатусСообщения.Внимание);
				
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 
Функция ПредставлениеАдреса(ВхАдрес)
	Если ТипЗнч(ВхАдрес) = Тип("Строка") Тогда
		Рез = ВхАдрес;
	ИначеЕсли ТипЗнч(ВхАдрес) = Тип("СправочникСсылка.уатПунктыНазначения") Тогда
		Если ПустаяСтрока(ВхАдрес.Адрес) Тогда
			Рез = ВхАдрес.Наименование;
		Иначе
			Рез = ВхАдрес.Адрес;
		КонецЕсли;
	Иначе
		Рез = "";
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция СведенияОЮрФизЛице(ЮрФизЛицо, ДатаПериода = '20200101', ДляФизЛицаТолькоИнициалы = Истина, БанковскийСчет = Неопределено) Экспорт
	
	Сведения = Новый Структура("Представление, ПолноеНаименование, СокращенноеНаименование, НаименованиеДляПечатныхФорм, 
	|КодПоОКПО, ИНН, КПП, Телефоны, ЮридическийАдрес, Банк, БИК, КоррСчет, НомерСчета, АдресБанка, Свидетельство");
	Запрос = Новый Запрос;
	Данные = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат Сведения;
	КонецЕсли;
	
	Если БанковскийСчет = Неопределено ИЛИ БанковскийСчет.Пустая() Тогда
		ТекБанковскийСчет = ЮрФизЛицо.ОсновнойБанковскийСчет;
	Иначе
		ТекБанковскийСчет = БанковскийСчет;
	КонецЕсли;
	
	Если ТекБанковскийСчет.БанкДляРасчетов.Пустая() Тогда
		ИмяРеквизитаБанка = "Банк";
	Иначе
		ИмяРеквизитаБанка = "БанкДляРасчетов";
	КонецЕсли;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		ИмяСправочника = "Организации";
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяСправочника = "Контрагенты";
	Иначе
		Возврат Сведения;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПарЮрФизЛицо", ЮрФизЛицо);
	Запрос.УстановитьПараметр("ПарБанковскийСчет", ТекБанковскийСчет);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Представление КАК Наименование,
	|	Организации.НаименованиеПолное КАК ПолноеНаименование,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.КодПоОКПО КАК КодПоОКПО,";
	
	Если ИмяСправочника = "Организации" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	Организации.НаименованиеСокращенное КАК СокращенноеНаименование,
		|	ВЫБОР 
		|		КОГДА Организации.ВариантНаименованияДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВариантыНаименованияДляПечатныхФорм.СокращенноеНаименование)
		|			ТОГДА Организации.НаименованиеСокращенное 
		|		ИНАЧЕ
		|			Организации.НаименованиеПолное
		|	КОНЕЦ КАК НаименованиеДляПечатныхФорм,
		|	Организации.СвидетельствоСерияНомер,
		|	Организации.СвидетельствоДатаВыдачи,";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	Организации.Представление КАК СокращенноеНаименование,
		|	Организации.НаименованиеПолное КАК НаименованиеДляПечатныхФорм,";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекБанковскийСчет) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	"""" КАК НомерСчета,
		|	"""" КАК Банк,
		|	"""" КАК БИК,
		|	"""" КАК КоррСчет,
		|	"""" КАК АдресБанка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК Организации
		|
		|ГДЕ
		|	Организации.Ссылка = &ПарЮрФизЛицо";
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + "
		|	БанковскиеСчета.НомерСчета КАК НомерСчета,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+" КАК Банк,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".Код КАК БИК,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".КоррСчет КАК КоррСчет,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".Адрес КАК АдресБанка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК Организации,
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|
		|ГДЕ
		|	Организации.Ссылка = &ПарЮрФизЛицо
		|	И БанковскиеСчета.Ссылка = &ПарБанковскийСчет";
		
	КонецЕсли;
	
	Данные = Запрос.Выполнить().Выбрать();
	Данные.Следующий();
	
	Если НЕ (ЮрФизЛицо.Метаданные().Реквизиты.Найти("ЮрФизЛицо") = Неопределено) Тогда
		
		Сведения.КодПоОКПО = Данные.КодПоОКПО;
		
		Если ЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			
			Сведения.КПП = Данные.КПП;
			
		ИначеЕсли ИмяСправочника = "Организации" Тогда
			
			Сведения.Свидетельство = "свидетельство " + Данные.СвидетельствоСерияНомер + " от " + Формат(Данные.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
			
		КонецЕсли;
		
	ИначеЕсли ИмяСправочника = "Организации" Тогда
		
		Сведения.КодПоОКПО = Данные.КодПоОКПО;
		Сведения.КПП = Данные.КПП;
		
	КонецЕсли;
	
	Сведения.Вставить("ПолноеНаименование", СокрЛП(Данные.ПолноеНаименование));
	Сведения.Вставить("СокращенноеНаименование", СокрЛП(Данные.СокращенноеНаименование));
	Сведения.Вставить("НаименованиеДляПечатныхФорм", СокрЛП(Данные.НаименованиеДляПечатныхФорм));
	Сведения.Вставить("Представление", СокрЛП(Данные.Наименование));
	
	Сведения.Вставить("ИНН", Данные.ИНН);
	Сведения.Вставить("Телефоны", ПолучитьТелефонИзКонтактнойИнформации(ЮрФизЛицо));
	Сведения.Вставить("НомерСчета", Данные.НомерСчета);
	Сведения.Вставить("Банк", Данные.Банк);
	Сведения.Вставить("БИК", Данные.БИК);
	Сведения.Вставить("АдресБанка", Данные.АдресБанка);
	Сведения.Вставить("КоррСчет", Данные.КоррСчет);
	Сведения.Вставить("ЮридическийАдрес", ПолучитьАдресИзКонтактнойИнформации(ЮрФизЛицо, "Юридический"));
	Сведения.Вставить("ФактическийАдрес", ПолучитьАдресИзКонтактнойИнформации(ЮрФизЛицо, "Фактический"));
	
	Если НЕ ЗначениеЗаполнено(Сведения.ПолноеНаименование) Тогда
		Сведения.ПолноеНаименование = Сведения.Представление;
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции

Функция ПолучитьАдресИзКонтактнойИнформации(Объект, ТипАдреса = "") Экспорт
	
	ОбъектКонтактнойИнформации = Объект;
	
	Если НЕ ЗначениеЗаполнено(ТипАдреса) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипАдреса="Фактический" Тогда
		Начало = "Факт";
	ИначеЕсли ТипАдреса="Регистрации"
		ИЛИ ТипАдреса="Юридический" Тогда
		Начало = "Юр";
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ОбъектКонтактнойИнформации = Объект.ИндивидуальныйПредприниматель;
			Окончание = "ФизЛица";
		Иначе
			Окончание = "Организации";
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Окончание = "Контрагента";
	КонецЕсли;
	
	ВидАдреса = Справочники.ВидыКонтактнойИнформации[Начало+"Адрес"+Окончание];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ОбъектКонтактнойИнформации);
	Запрос.УстановитьПараметр("Тип" , Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид" , ВидАдреса);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка = &Объект
	|	И ОрганизацииКонтактнаяИнформация.Тип = &Тип
	|	И ОрганизацииКонтактнаяИнформация.Вид = &Вид";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;
	
КонецФункции
Функция ПолучитьТелефонИзКонтактнойИнформации(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Окончание = "Организации";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Окончание = "Контрагента";
	КонецЕсли;
	
	ВидТелефона = Справочники.ВидыКонтактнойИнформации["Телефон" + Окончание];
	
	Факс = "";
	
	Если Окончание = "Организации" Тогда
		
		ВидФакса = Справочники.ВидыКонтактнойИнформации["ФаксОрганизации"];
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Тип" , Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("Вид" , ВидФакса);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Объект
		|	И ОрганизацииКонтактнаяИнформация.Тип = &Тип
		|	И ОрганизацииКонтактнаяИнформация.Вид = &Вид";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Факс = ", факс: " + РезультатЗапроса.Выгрузить()[0].Представление;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип" , Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид" , ВидТелефона);
	
	Если Окончание = "Организации" Тогда
		Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Запрос.УстановитьПараметр("Объект", Объект.ИндивидуальныйПредприниматель);
			Запрос.УстановитьПараметр("Вид" , Справочники.ВидыКонтактнойИнформации.ТелефонСлужебныйФизЛица);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка = &Объект
	|	И ОрганизацииКонтактнаяИнформация.Тип = &Тип
	|	И ОрганизацииКонтактнаяИнформация.Вид = &Вид";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление + Факс;
	КонецЕсли;
	
КонецФункции 
Функция ПолучитьУдостоверениеСотрудника(Дата, ФизЛицо, ВидДокумента) Экспорт
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	уатДокументыВодителя.Серия КАК Серия,
	|	уатДокументыВодителя.Номер КАК Номер,
	|	уатДокументыВодителя.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	РегистрСведений.уатДокументыВодителя КАК уатДокументыВодителя
	|ГДЕ
	|	уатДокументыВодителя.ФизЛицо = &ФизЛицо
	|	И уатДокументыВодителя.ВидДокумента = &ВидДокумента
	|	И уатДокументыВодителя.ДатаВыдачи <= &Дата
	|	И (уатДокументыВодителя.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ уатДокументыВодителя.ДатаОкончания >= &Дата)
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатДокументыВодителя.ДатаВыдачи
	|АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Серия", Выборка.Серия);
		Результат.Вставить("Номер", Выборка.Номер);
		Результат.Вставить("ДатаВыдачи", Выборка.ДатаВыдачи);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция уатПрочитатьРеквизитыТС(ТС, Реквизит = "", ДатаСреза = Неопределено, СведенияЕсть = Истина, флСообщать = Ложь) Экспорт
	
	Возврат ТС;
	
КонецФункции 

НаименованиеКонтрагентаСокращенное = Истина;

//-- Семенов Е.А. 12.11.2025
