
&НаКлиенте
Процедура Выгрузить(Команда)
    ВыгрузитьНаСервере();	
КонецПроцедуры
	
&НаСервере
Процедура ВыгрузитьНаСервере()
	//СсылкаНаНоменклатуру =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("1e57d82f-bacd-11f0-8ed4-00155d0c8404")); //Включено 
	СсылкаНаНоменклатуру =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("9db2bede-c224-11e3-a7f0-005056b6288a")); //Не включено
	Настройка = ПланыВидовХарактеристик.игсНастройкиМеханизмов.НоменклатураПодлежащаяВыгрузкеВУАТ;
	СсылкаНаПапкуНоменклатуры = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	игсНастройкиМеханизмовСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.игсНастройкиМеханизмов.СрезПоследних(, Настройка = &Настройка) КАК игсНастройкиМеханизмовСрезПоследних";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
	    СсылкаНаПапкуНоменклатуры = РезультатЗапроса.Значение;	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&СсылкаНаПапкуНоменклатуры)
		|	И Номенклатура.Ссылка <> &СсылкаНаПапкуНоменклатуры
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Ссылка = &СсылкаНаНоменклатуру";
	
	Запрос.УстановитьПараметр("СсылкаНаПапкуНоменклатуры", СсылкаНаПапкуНоменклатуры);
	Запрос.УстановитьПараметр("СсылкаНаНоменклатуру", СсылкаНаНоменклатуру);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
	    Отказ = Истина;	
	КонецЕсли;	
		
КонецПроцедуры	
	