
Функция СведенияОВнешнейОбработке() Экспорт     
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.3.0");
	ПараметрыРегистрации.Информация 		= НСтр("ru = 'Отчет , собирающий информацию по всем путевым листам за период и анализирующий те из них, 
																						|которые не были отражены в документе «Реализация услуг».'");
	ПараметрыРегистрации.Наименование 		= НСтр("ru = 'Путевые листы не попавшие в реестры'");	
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия 			= "1.0";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	
	Команда 								= ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление 					= НСтр("ru = 'Путевые листы не попавшие в реестры'");
	Команда.Идентификатор 					= "ПутевыеЛистыНеПопавшиеВРеестр";
	Команда.Использование 					= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение 			= Ложь;
	Команда.Модификатор 					= "ПечатьMXL";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции